"use client";
import React, { useState, useEffect } from 'react'

import Image from "next/image";
import Link from "next/link";

export default function Page() {
  
  const [text, settext] = useState([])
  const [highlightIndex, setHighlightIndex] = useState(0)
  const [lines, setLines] = useState(4)
const [delay, setDelay] = useState(2)
const [issettingopen, setIssettingopen] = useState(false)
  const color = [
    { text: "text-emerald-400", bg: "bg-emerald-900" },
    { text: "text-neutral-300", bg: "bg-neutral-900" },
    { text: "text-fuchsia-400", bg: "bg-fuchsia-900" },
    { text: "text-indigo-300", bg: "bg-indigo-900" },
    { text: "text-gray-300", bg: "bg-gray-900" },
    { text: "text-pink-400", bg: "bg-pink-900" },
    { text: "text-cyan-400", bg: "bg-cyan-900" },
    { text: "text-rose-400", bg: "bg-rose-900" },
    { text: "text-white", bg: "bg-black" },
    { text: "text-amber-400", bg: "bg-amber-900" },
    { text: "text-teal-400", bg: "bg-teal-900" },
    { text: "text-purple-400", bg: "bg-purple-900" },
    { text: "text-lime-400", bg: "bg-lime-900" },
    { text: "text-indigo-400", bg: "bg-indigo-900" },
    { text: "text-yellow-400", bg: "bg-yellow-900" },
    { text: "text-stone-300", bg: "bg-stone-900" },
    { text: "text-sky-400", bg: "bg-sky-900" },
    { text: "text-rose-300", bg: "bg-rose-900" },
    { text: "text-green-400", bg: "bg-green-900" },
    { text: "text-cyan-300", bg: "bg-cyan-900" },
    { text: "text-orange-400", bg: "bg-orange-900" },
    { text: "text-sky-300", bg: "bg-sky-900" },
    { text: "text-fuchsia-300", bg: "bg-fuchsia-900" },
    { text: "text-violet-400", bg: "bg-violet-900" },
    { text: "text-pink-300", bg: "bg-pink-900" },
    { text: "text-green-300", bg: "bg-green-900" },
    { text: "text-blue-400", bg: "bg-blue-900" },
    { text: "text-red-400", bg: "bg-red-900" }, // << ✅ missing earlier, added now
  ];
  const array = [
    { name: "JapjiSahib", link: "/JapjiSahib.png" },
    { name: "JaapSahib", link: "/JaapSahib.png" },
    { name: "TavPrasadSavaiye", link: "/TavPrasadSavaiye.png" },
    { name: "ChaupaiSahib", link: "/ChaupaiSahib.png" },
    { name: "AnandSahib", link: "/AnandSahib.png" },
  ]
   const handleSettingsToggle = () => {
    setIssettingopen(!issettingopen);
  };
  const back=() => {
    settext([])
  }
  const translate=async(lang)=>{
if (text.length==385) {
  let a =await fetch("http://localhost:3000/punjabiJapji.json")
  let b=await a.json()
  console.log(b)
  settext(b)
}
if (text.length==444) {
  let a = await fetch("http://localhost:3000/punjabiJaap.json")
  let b=await a.json()
  settext(b)
}
if (text.length==41) {
  let a = await fetch("http://localhost:3000/punjabiTav.json")
  let b=await a.json()
  settext(b)
}
if (text.length==104) {
  let a = await fetch("http://localhost:3000/punjabiChaupai.json")
  let b=await a.json()
  settext(b)
}
if (text.length==385) {
  let a = await fetch("http://localhost:3000/punjabiAnand.json")
  let b=await a.json()
  settext(b)
}
  }
  const showtext = (name) => {

    if (name === "JapjiSahib") {
      settext([
        { index: 1, text: "ੴ सतिनामु करता पुरखु निरभउ निरवैरु अकाल मूरति अजूनी सैभं गुरप्रसादि ॥" },
        { index: 2, text: "॥ जपु ॥" },
        { index: 3, text: "आदि सचु जुगादि सचु ॥" },
        { index: 4, text: "है भी सचु नानक होसी भी सचु ॥१॥" },
        { index: 5, text: "सोचै सोचि न होवई जे सोची लख वार ॥" },
        { index: 6, text: "चुपै चुप न होवई जे लाइ रहा लिव तार ॥" },
        { index: 7, text: "भुखिआ भुख न उतरी जे बंना पुरीआ भार ॥" },
        { index: 8, text: "सहस सिआणपा लख होहि त इक न चलै नालि ॥" },
        { index: 9, text: "किव सचिआरा होईऐ किव कूड़ै तुटै पालि ॥" },
        { index: 10, text: "हुकमि रजाई चलणा नानक लिखिआ नालि ॥१॥" },
        { index: 11, text: "हुकमी होवनि आकार हुकमु न कहिआ जाई ॥" },
        { index: 12, text: "हुकमी होवनि जीअ हुकमि मिलै वडिआई ॥" },
        { index: 13, text: "हुकमी उतमु नीचु हुकमि लिखि दुख सुख पाईअहि ॥" },
        { index: 14, text: "इकना हुकमी बखसीस इकि हुकमी सदा भवाईअहि ॥" },
        { index: 15, text: "हुकमै अंदरि सभु को बाहरि हुकम न कोइ ॥" },
        { index: 16, text: "नानक हुकमै जे बुझै त हउमै कहै न कोइ ॥२॥" },
        { index: 17, text: "गावै को ताणु होवै किसै ताणु ॥" },
        { index: 18, text: "गावै को दाति जाणै नीसाणु ॥" },
        { index: 19, text: "गावै को गुण वडिआईआ चार ॥" },
        { index: 20, text: "गावै को विदिआ विखमु वीचारु ॥" },
        { index: 21, text: "गावै को साजि करे तनु खेह ॥" },
        { index: 22, text: "गावै को जीअ लै फिरि देह ॥" },
        { index: 23, text: "गावै को जापै दिसै दूरि ॥" },
        { index: 24, text: "गावै को वेखै हादरा हदूरि ॥" },
        { index: 25, text: "कथना कथी न आवै तोटि ॥" },
        { index: 26, text: "कथि कथि कथी कोटी कोटि कोटि ॥" },
        { index: 27, text: "देदा दे लैदे थकि पाहि ॥" },
        { index: 13, text: "जुगा जुगंतरि खाही खाहि ॥" },
        { index: 1, text: "हुकमी हुकमु चलाए राहु ॥" },
        { index: 2, text: "नानक विगसै वेपरवाहु ॥३॥" },
        { index: 3, text: "साचा साहिबु साचु नाइ भाखिआ भाउ अपारु ॥" },
        { index: 4, text: "आखहि मंगहि देहि देहि दाति करे दातारु ॥" },
        { index: 5, text: "फेरि कि अगै रखीऐ जितु दिसै दरबारु ॥" },
        { index: 6, text: "मुहौ कि बोलणु बोलीऐ जितु सुणि धरे पिआरु ॥" },
        { index: 7, text: "अम्रित वेला सचु नाउ वडिआई वीचारु ॥" },
        { index: 8, text: "करमी आवै कपड़ा नदरी मोखु दुआरु ॥" },
        { index: 9, text: "नानक एवै जाणीऐ सभु आपे सचिआरु ॥४॥" },
        { index: 10, text: "थापिआ न जाइ कीता न होइ ॥" },
        { index: 11, text: "आपे आपि निरंजनु सोइ ॥" },
        { index: 12, text: "जिनि सेविआ तिनि पाइआ मानु ॥" },
        { index: 13, text: "नानक गावीऐ गुणी निधानु ॥" },
        { index: 14, text: "गावीऐ सुणीऐ मनि रखीऐ भाउ ॥" },
        { index: 15, text: "दुखु परहरि सुखु घरि लै जाइ ॥" },
        { index: 16, text: "गुरमुखि नादं गुरमुखि वेदं गुरमुखि रहिआ समाई ॥" },
        { index: 17, text: "गुरु ईसरु गुरु गोरखु बरमा गुरु पारबती माई ॥" },
        { index: 18, text: "जे हउ जाणा आखा नाही कहणा कथनु न जाई ॥" },
        { index: 19, text: "गुरा इक देहि बुझाई ॥" },
        { index: 20, text: "सभना जीआ का इकु दाता सो मै विसरि न जाई ॥५॥" },
        { index: 21, text: "तीरथि नावा जे तिसु भावा विणु भाणे कि नाइ करी ॥" },
        { index: 22, text: "जेती सिरठि उपाई वेखा विणु करमा कि मिलै लई ॥" },
        { index: 23, text: "मति विचि रतन जवाहर माणिक जे इक गुर की सिख सुणी ॥" },
        { index: 24, text: "गुरा इक देहि बुझाई ॥" },
        { index: 25, text: "सभना जीआ का इकु दाता सो मै विसरि न जाई ॥६॥" },
        { index: 26, text: "जे जुग चारे आरजा होर दसूणी होइ ॥" },
        { index: 27, text: "नवा खंडा विचि जाणीऐ नालि चलै सभु कोइ ॥" },
        { index: 13, text: "चंगा नाउ रखाइ कै जसु कीरति जगि लेइ ॥" },
        { index: 1, text: "जे तिसु नदरि न आवई त वात न पुछै के ॥" },
        { index: 2, text: "कीटा अंदरि कीटु करि दोसी दोसु धरे ॥" },
        { index: 3, text: "नानक निरगुणि गुणु करे गुणवंतिआ गुणु दे ॥" },
        { index: 4, text: "तेहा कोइ न सुझई जि तिसु गुणु कोइ करे ॥७॥" },
        { index: 5, text: "सुणिऐ सिध पीर सुरि नाथ ॥" },
        { index: 6, text: "सुणिऐ धरति धवल आकास ॥" },
        { index: 7, text: "सुणिऐ दीप लोअ पाताल ॥" },
        { index: 8, text: "सुणिऐ पोहि न सकै कालु ॥" },
        { index: 9, text: "नानक भगता सदा विगासु ॥" },
        { index: 10, text: "सुणिऐ दूख पाप का नासु ॥८॥" },
        { index: 11, text: "सुणिऐ ईसरु बरमा इंदु ॥" },
        { index: 12, text: "सुणिऐ मुखि सालाहण मंदु ॥" },
        { index: 13, text: "सुणिऐ जोग जुगति तनि भेद ॥" },
        { index: 14, text: "सुणिऐ सासत सिम्रिति वेद ॥" },
        { index: 15, text: "नानक भगता सदा विगासु ॥" },
        { index: 16, text: "सुणिऐ दूख पाप का नासु ॥९॥" },
        { index: 17, text: "सुणिऐ सतु संतोखु गिआनु ॥" },
        { index: 18, text: "सुणिऐ अठसठि का इसनानु ॥" },
        { index: 19, text: "सुणिऐ पड़ि पड़ि पावहि मानु ॥" },
        { index: 20, text: "सुणिऐ लागै सहजि धिआनु ॥" },
        { index: 21, text: "नानक भगता सदा विगासु ॥" },
        { index: 22, text: "सुणिऐ दूख पाप का नासु ॥१०॥" },
        { index: 23, text: "सुणिऐ सरा गुणा के गाह ॥" },
        { index: 24, text: "सुणिऐ सेख पीर पातिसाह ॥" },
        { index: 25, text: "सुणिऐ अंधे पावहि राहु ॥" },
        { index: 26, text: "सुणिऐ हाथ होवै असगाहु ॥" },
        { index: 27, text: "नानक भगता सदा विगासु ॥" },
        { index: 13, text: "सुणिऐ दूख पाप का नासु ॥११॥" },
        { index: 1, text: "मंने की गति कही न जाइ ॥" },
        { index: 2, text: "जे को कहै पिछै पछुताइ ॥" },
        { index: 3, text: "कागदि कलम न लिखणहारु ॥" },
        { index: 4, text: "मंने का बहि करनि वीचारु ॥" },
        { index: 5, text: "ऐसा नामु निरंजनु होइ ॥" },
        { index: 6, text: "जे को मंनि जाणै मनि कोइ ॥१२॥" },
        { index: 7, text: "मंनै सुरति होवै मनि बुधि ॥" },
        { index: 8, text: "मंनै सगल भवण की सुधि ॥" },
        { index: 9, text: "मंनै मुहि चोटा ना खाइ ॥" },
        { index: 10, text: "मंनै जम कै साथि न जाइ ॥" },
        { index: 11, text: "ऐसा नामु निरंजनु होइ ॥" },
        { index: 12, text: "जे को मंनि जाणै मनि कोइ ॥१३॥" },
        { index: 13, text: "मंनै मारगि ठाक न पाइ ॥" },
        { index: 14, text: "मंनै पति सिउ परगटु जाइ ॥" },
        { index: 15, text: "मंनै मगु न चलै पंथु ॥" },
        { index: 16, text: "मंनै धरम सेती सनबंधु ॥" },
        { index: 17, text: "ऐसा नामु निरंजनु होइ ॥" },
        { index: 18, text: "जे को मंनि जाणै मनि कोइ ॥१४॥" },
        { index: 19, text: "मंनै पावहि मोखु दुआरु ॥" },
        { index: 20, text: "मंनै परवारै साधारु ॥" },
        { index: 21, text: "मंनै तरै तारे गुरु सिख ॥" },
        { index: 22, text: "मंनै नानक भवहि न भिख ॥" },
        { index: 23, text: "ऐसा नामु निरंजनु होइ ॥" },
        { index: 24, text: "जे को मंनि जाणै मनि कोइ ॥१५॥" },
        { index: 25, text: "पंच परवाण पंच परधानु ॥" },
        { index: 26, text: "पंचे पावहि दरगहि मानु ॥" },
        { index: 27, text: "पंचे सोहहि दरि राजानु ॥" },
        { index: 13, text: "पंचा का गुरु एकु धिआनु ॥" },
        { index: 1, text: "जे को कहै करै वीचारु ॥" },
        { index: 2, text: "करते कै करणै नाही सुमारु ॥" },
        { index: 3, text: "धौलु धरमु दइआ का पूतु ॥" },
        { index: 4, text: "संतोखु थापि रखिआ जिनि सूति ॥" },
        { index: 5, text: "जे को बुझै होवै सचिआरु ॥" },
        { index: 6, text: "धवलै उपरि केता भारु ॥" },
        { index: 7, text: "धरती होरु परै होरु होरु ॥" },
        { index: 8, text: "तिस ते भारु तलै कवणु जोरु ॥" },
        { index: 9, text: "जीअ जाति रंगा के नाव ॥" },
        { index: 10, text: "सभना लिखिआ वुड़ी कलाम ॥" },
        { index: 11, text: "एहु लेखा लिखि जाणै कोइ ॥" },
        { index: 12, text: "लेखा लिखिआ केता होइ ॥" },
        { index: 13, text: "केता ताणु सुआलिहु रूपु ॥" },
        { index: 14, text: "केती दाति जाणै कौणु कूतु ॥" },
        { index: 15, text: "कीता पसाउ एको कवाउ ॥" },
        { index: 16, text: "तिस ते होए लख दरीआउ ॥" },
        { index: 17, text: "कुदरति कवण कहा वीचारु ॥" },
        { index: 18, text: "वारिआ न जावा एक वार ॥" },
        { index: 19, text: "जो तुधु भावै साई भली कार ॥" },
        { index: 20, text: "तू सदा सलामति निरंकार ॥१६॥" },
        { index: 21, text: "असंख जप असंख भाउ ॥" },
        { index: 22, text: "असंख पूजा असंख तप ताउ ॥" },
        { index: 23, text: "असंख गरंथ मुखि वेद पाठ ॥" },
        { index: 24, text: "असंख जोग मनि रहहि उदास ॥" },
        { index: 25, text: "असंख भगत गुण गिआन वीचार ॥" },
        { index: 26, text: "असंख सती असंख दातार ॥" },
        { index: 27, text: "असंख सूर मुह भख सार ॥" },
        { index: 13, text: "असंख मोनि लिव लाइ तार ॥" },
        { index: 1, text: "कुदरति कवण कहा वीचारु ॥" },
        { index: 2, text: "वारिआ न जावा एक वार ॥" },
        { index: 3, text: "जो तुधु भावै साई भली कार ॥" },
        { index: 4, text: "तू सदा सलामति निरंकार ॥१७॥" },
        { index: 5, text: "असंख मूरख अंध घोर ॥" },
        { index: 6, text: "असंख चोर हरामखोर ॥" },
        { index: 7, text: "असंख अमर करि जाहि जोर ॥" },
        { index: 8, text: "असंख गलवढ हतिआ कमाहि ॥" },
        { index: 9, text: "असंख पापी पापु करि जाहि ॥" },
        { index: 10, text: "असंख कूड़िआर कूड़े फिराहि ॥" },
        { index: 11, text: "असंख मलेछ मलु भखि खाहि ॥" },
        { index: 12, text: "असंख निंदक सिरि करहि भारु ॥" },
        { index: 13, text: "नानकु नीचु कहै वीचारु ॥" },
        { index: 14, text: "वारिआ न जावा एक वार ॥" },
        { index: 15, text: "जो तुधु भावै साई भली कार ॥" },
        { index: 16, text: "तू सदा सलामति निरंकार ॥१८॥" },
        { index: 17, text: "असंख नाव असंख थाव ॥" },
        { index: 18, text: "अगम अगम असंख लोअ ॥" },
        { index: 19, text: "असंख कहहि सिरि भारु होइ ॥" },
        { index: 20, text: "अखरी नामु अखरी सालाह ॥" },
        { index: 21, text: "अखरी गिआनु गीत गुण गाह ॥" },
        { index: 22, text: "अखरी लिखणु बोलणु बाणि ॥" },
        { index: 23, text: "अखरा सिरि संजोगु वखाणि ॥" },
        { index: 24, text: "जिनि एहि लिखे तिसु सिरि नाहि ॥" },
        { index: 25, text: "जिव फुरमाए तिव तिव पाहि ॥" },
        { index: 26, text: "जेता कीता तेता नाउ ॥" },
        { index: 27, text: "विणु नावै नाही को थाउ ॥" },
        { index: 13, text: "कुदरति कवण कहा वीचारु ॥" },
        { index: 1, text: "वारिआ न जावा एक वार ॥" },
        { index: 2, text: "जो तुधु भावै साई भली कार ॥" },
        { index: 3, text: "तू सदा सलामति निरंकार ॥१९॥" },
        { index: 4, text: "भरीऐ हथु पैरु तनु देह ॥" },
        { index: 5, text: "पाणी धोतै उतरसु खेह ॥" },
        { index: 6, text: "मूत पलीती कपड़ु होइ ॥" },
        { index: 7, text: "दे साबूणु लईऐ ओहु धोइ ॥" },
        { index: 8, text: "भरीऐ मति पापा कै संगि ॥" },
        { index: 9, text: "ओहु धोपै नावै कै रंगि ॥" },
        { index: 10, text: "पुंनी पापी आखणु नाहि ॥" },
        { index: 11, text: "करि करि करणा लिखि लै जाहु ॥" },
        { index: 12, text: "आपे बीजि आपे ही खाहु ॥" },
        { index: 13, text: "नानक हुकमी आवहु जाहु ॥२०॥" },
        { index: 14, text: "तीरथु तपु दइआ दतु दानु ॥" },
        { index: 15, text: "जे को पावै तिल का मानु ॥" },
        { index: 16, text: "सुणिआ मंनिआ मनि कीता भाउ ॥" },
        { index: 17, text: "अंतरगति तीरथि मलि नाउ ॥" },
        { index: 18, text: "सभि गुण तेरे मै नाही कोइ ॥" },
        { index: 19, text: "विणु गुण कीते भगति न होइ ॥" },
        { index: 20, text: "सुअसति आथि बाणी बरमाउ ॥" },
        { index: 21, text: "सति सुहाणु सदा मनि चाउ ॥" },
        { index: 22, text: "कवणु सु वेला वखतु कवणु कवण थिति कवणु वारु ॥" },
        { index: 23, text: "कवणि सि रुती माहु कवणु जितु होआ आकारु ॥" },
        { index: 24, text: "वेल न पाईआ पंडती जि होवै लेखु पुराणु ॥" },
        { index: 25, text: "वखतु न पाइओ कादीआ जि लिखनि लेखु कुराणु ॥" },
        { index: 26, text: "थिति वारु ना जोगी जाणै रुति माहु ना कोई ॥" },
        { index: 27, text: "जा करता सिरठी कउ साजे आपे जाणै सोई ॥" },
        { index: 13, text: "किव करि आखा किव सालाही किउ वरनी किव जाणा ॥" },
        { index: 1, text: "नानक आखणि सभु को आखै इक दू इकु सिआणा ॥" },
        { index: 2, text: "वडा साहिबु वडी नाई कीता जा का होवै ॥" },
        { index: 3, text: "नानक जे को आपौ जाणै अगै गइआ न सोहै ॥२१॥" },
        { index: 4, text: "पाताला पाताल लख आगासा आगास ॥" },
        { index: 5, text: "ओड़क ओड़क भालि थके वेद कहनि इक वात ॥" },
        { index: 6, text: "सहस अठारह कहनि कतेबा असुलू इकु धातु ॥" },
        { index: 7, text: "लेखा होइ त लिखीऐ लेखै होइ विणासु ॥" },
        { index: 8, text: "नानक वडा आखीऐ आपे जाणै आपु ॥२२॥" },
        { index: 9, text: "सालाही सालाहि एती सुरति न पाईआ ॥" },
        { index: 10, text: "नदीआ अतै वाह पवहि समुंदि न जाणीअहि ॥" },
        { index: 11, text: "समुंद साह सुलतान गिरहा सेती मालु धनु ॥" },
        { index: 12, text: "कीड़ी तुलि न होवनी जे तिसु मनहु न वीसरहि ॥२३॥" },
        { index: 13, text: "अंतु न सिफती कहणि न अंतु ॥" },
        { index: 14, text: "अंतु न करणै देणि न अंतु ॥" },
        { index: 15, text: "अंतु न वेखणि सुणणि न अंतु ॥" },
        { index: 16, text: "अंतु न जापै किआ मनि मंतु ॥" },
        { index: 17, text: "अंतु न जापै कीता आकारु ॥" },
        { index: 18, text: "अंतु न जापै पारावारु ॥" },
        { index: 19, text: "अंत कारणि केते बिललाहि ॥" },
        { index: 20, text: "ता के अंत न पाए जाहि ॥" },
        { index: 21, text: "एहु अंतु न जाणै कोइ ॥" },
        { index: 22, text: "बहुता कहीऐ बहुता होइ ॥" },
        { index: 23, text: "वडा साहिबु ऊचा थाउ ॥" },
        { index: 24, text: "ऊचे उपरि ऊचा नाउ ॥" },
        { index: 25, text: "एवडु ऊचा होवै कोइ ॥" },
        { index: 26, text: "तिसु ऊचे कउ जाणै सोइ ॥" },
        { index: 27, text: "जेवडु आपि जाणै आपि आपि ॥" },
        { index: 13, text: "नानक नदरी करमी दाति ॥२४॥" },
        { index: 1, text: "बहुता करमु लिखिआ ना जाइ ॥" },
        { index: 2, text: "वडा दाता तिलु न तमाइ ॥" },
        { index: 3, text: "केते मंगहि जोध अपार ॥" },
        { index: 4, text: "केतिआ गणत नही वीचारु ॥" },
        { index: 5, text: "केते खपि तुटहि वेकार ॥" },
        { index: 6, text: "केते लै लै मुकरु पाहि ॥" },
        { index: 7, text: "केते मूरख खाही खाहि ॥" },
        { index: 8, text: "केतिआ दूख भूख सद मार ॥" },
        { index: 9, text: "एहि भि दाति तेरी दातार ॥" },
        { index: 10, text: "बंदि खलासी भाणै होइ ॥" },
        { index: 11, text: "होरु आखि न सकै कोइ ॥" },
        { index: 12, text: "जे को खाइकु आखणि पाइ ॥" },
        { index: 13, text: "ओहु जाणै जेतीआ मुहि खाइ ॥" },
        { index: 14, text: "आपे जाणै आपे देइ ॥" },
        { index: 15, text: "आखहि सि भि केई केइ ॥" },
        { index: 16, text: "जिस नो बखसे सिफति सालाह ॥" },
        { index: 17, text: "नानक पातिसाही पातिसाहु ॥२५॥" },
        { index: 18, text: "अमुल गुण अमुल वापार ॥" },
        { index: 19, text: "अमुल वापारीए अमुल भंडार ॥" },
        { index: 20, text: "अमुल आवहि अमुल लै जाहि ॥" },
        { index: 21, text: "अमुल भाइ अमुला समाहि ॥" },
        { index: 22, text: "अमुलु धरमु अमुलु दीबाणु ॥" },
        { index: 23, text: "अमुलु तुलु अमुलु परवाणु ॥" },
        { index: 24, text: "अमुलु बखसीस अमुलु नीसाणु ॥" },
        { index: 25, text: "अमुलु करमु अमुलु फुरमाणु ॥" },
        { index: 26, text: "अमुलो अमुलु आखिआ न जाइ ॥" },
        { index: 27, text: "आखि आखि रहे लिव लाइ ॥" },
        { index: 13, text: "आखहि वेद पाठ पुराण ॥" },
        { index: 1, text: "आखहि पड़े करहि वखिआण ॥" },
        { index: 2, text: "आखहि बरमे आखहि इंद ॥" },
        { index: 3, text: "आखहि गोपी तै गोविंद ॥" },
        { index: 4, text: "आखहि ईसर आखहि सिध ॥" },
        { index: 5, text: "आखहि केते कीते बुध ॥" },
        { index: 6, text: "आखहि दानव आखहि देव ॥" },
        { index: 7, text: "आखहि सुरि नर मुनि जन सेव ॥" },
        { index: 8, text: "केते आखहि आखणि पाहि ॥" },
        { index: 9, text: "केते कहि कहि उठि उठि जाहि ॥" },
        { index: 10, text: "एते कीते होरि करेहि ॥" },
        { index: 11, text: "ता आखि न सकहि केई केइ ॥" },
        { index: 12, text: "जेवडु भावै तेवडु होइ ॥" },
        { index: 13, text: "नानक जाणै साचा सोइ ॥" },
        { index: 14, text: "जे को आखै बोलुविगाड़ु ॥" },
        { index: 15, text: "ता लिखीऐ सिरि गावारा गावारु ॥२६॥" },
        { index: 16, text: "सो दरु केहा सो घरु केहा जितु बहि सरब समाले ॥" },
        { index: 17, text: "वाजे नाद अनेक असंखा केते वावणहारे ॥" },
        { index: 18, text: "केते राग परी सिउ कहीअनि केते गावणहारे ॥" },
        { index: 19, text: "गावहि तुहनो पउणु पाणी बैसंतरु गावै राजा धरमु दुआरे ॥" },
        { index: 20, text: "गावहि चितु गुपतु लिखि जाणहि लिखि लिखि धरमु वीचारे ॥" },
        { index: 21, text: "गावहि ईसरु बरमा देवी सोहनि सदा सवारे ॥" },
        { index: 22, text: "गावहि इंद इदासणि बैठे देवतिआ दरि नाले ॥" },
        { index: 23, text: "गावहि सिध समाधी अंदरि गावनि साध विचारे ॥" },
        { index: 24, text: "गावनि जती सती संतोखी गावहि वीर करारे ॥" },
        { index: 25, text: "गावनि पंडित पड़नि रखीसर जुगु जुगु वेदा नाले ॥" },
        { index: 26, text: "गावहि मोहणीआ मनु मोहनि सुरगा मछ पइआले ॥" },
        { index: 27, text: "गावनि रतन उपाए तेरे अठसठि तीरथ नाले ॥" },
        { index: 13, text: "गावहि जोध महाबल सूरा गावहि खाणी चारे ॥" },
        { index: 1, text: "गावहि खंड मंडल वरभंडा करि करि रखे धारे ॥" },
        { index: 2, text: "सेई तुधुनो गावहि जो तुधु भावनि रते तेरे भगत रसाले ॥" },
        { index: 3, text: "होरि केते गावनि से मै चिति न आवनि नानकु किआ वीचारे ॥" },
        { index: 4, text: "सोई सोई सदा सचु साहिबु साचा साची नाई ॥" },
        { index: 5, text: "है भी होसी जाइ न जासी रचना जिनि रचाई ॥" },
        { index: 6, text: "रंगी रंगी भाती करि करि जिनसी माइआ जिनि उपाई ॥" },
        { index: 7, text: "करि करि वेखै कीता आपणा जिव तिस दी वडिआई ॥" },
        { index: 8, text: "जो तिसु भावै सोई करसी हुकमु न करणा जाई ॥" },
        { index: 9, text: "सो पातिसाहु साहा पातिसाहिबु नानक रहणु रजाई ॥२७॥" },
        { index: 10, text: "मुंदा संतोखु सरमु पतु झोली धिआन की करहि बिभूति ॥" },
        { index: 11, text: "खिंथा कालु कुआरी काइआ जुगति डंडा परतीति ॥" },
        { index: 12, text: "आई पंथी सगल जमाती मनि जीतै जगु जीतु ॥" },
        { index: 13, text: "आदेसु तिसै आदेसु ॥" },
        { index: 14, text: "आदि अनीलु अनादि अनाहति जुगु जुगु एको वेसु ॥२८॥" },
        { index: 15, text: "भुगति गिआनु दइआ भंडारणि घटि घटि वाजहि नाद ॥" },
        { index: 16, text: "आपि नाथु नाथी सभ जा की रिधि सिधि अवरा साद ॥" },
        { index: 17, text: "संजोगु विजोगु दुइ कार चलावहि लेखे आवहि भाग ॥" },
        { index: 18, text: "आदेसु तिसै आदेसु ॥" },
        { index: 19, text: "आदि अनीलु अनादि अनाहति जुगु जुगु एको वेसु ॥२९॥" },
        { index: 20, text: "एका माई जुगति विआई तिनि चेले परवाणु ॥" },
        { index: 21, text: "इकु संसारी इकु भंडारी इकु लाए दीबाणु ॥" },
        { index: 22, text: "जिव तिसु भावै तिवै चलावै जिव होवै फुरमाणु ॥" },
        { index: 23, text: "ओहु वेखै ओना नदरि न आवै बहुता एहु विडाणु ॥" },
        { index: 24, text: "आदेसु तिसै आदेसु ॥" },
        { index: 25, text: "आदि अनीलु अनादि अनाहति जुगु जुगु एको वेसु ॥३०॥" },
        { index: 26, text: "आसणु लोइ लोइ भंडार ॥" },
        { index: 27, text: "जो किछु पाइआ सु एका वार ॥" },
        { index: 13, text: "करि करि वेखै सिरजणहारु ॥" },
        { index: 1, text: "नानक सचे की साची कार ॥" },
        { index: 2, text: "आदेसु तिसै आदेसु ॥" },
        { index: 3, text: "आदि अनीलु अनादि अनाहति जुगु जुगु एको वेसु ॥३१॥" },
        { index: 4, text: "इक दू जीभौ लख होहि लख होवहि लख वीस ॥" },
        { index: 5, text: "लखु लखु गेड़ा आखीअहि एकु नामु जगदीस ॥" },
        { index: 6, text: "एतु राहि पति पवड़ीआ चड़ीऐ होइ इकीस ॥" },
        { index: 7, text: "सुणि गला आकास की कीटा आई रीस ॥" },
        { index: 8, text: "नानक नदरी पाईऐ कूड़ी कूड़ै ठीस ॥३२॥" },
        { index: 9, text: "आखणि जोरु चुपै नह जोरु ॥" },
        { index: 10, text: "जोरु न मंगणि देणि न जोरु ॥" },
        { index: 11, text: "जोरु न जीवणि मरणि नह जोरु ॥" },
        { index: 12, text: "जोरु न राजि मालि मनि सोरु ॥" },
        { index: 13, text: "जोरु न सुरती गिआनि वीचारि ॥" },
        { index: 14, text: "जोरु न जुगती छुटै संसारु ॥" },
        { index: 15, text: "जिसु हथि जोरु करि वेखै सोइ ॥" },
        { index: 16, text: "नानक उतमु नीचु न कोइ ॥३३॥" },
        { index: 17, text: "राती रुती थिती वार ॥" },
        { index: 18, text: "पवण पाणी अगनी पाताल ॥" },
        { index: 19, text: "तिसु विचि धरती थापि रखी धरम साल ॥" },
        { index: 20, text: "तिसु विचि जीअ जुगति के रंग ॥" },
        { index: 21, text: "तिन के नाम अनेक अनंत ॥" },
        { index: 22, text: "करमी करमी होइ वीचारु ॥" },
        { index: 23, text: "सचा आपि सचा दरबारु ॥" },
        { index: 24, text: "तिथै सोहनि पंच परवाणु ॥" },
        { index: 25, text: "नदरी करमि पवै नीसाणु ॥" },
        { index: 26, text: "कच पकाई ओथै पाइ ॥" },
        { index: 27, text: "नानक गइआ जापै जाइ ॥३४॥" },
        { index: 13, text: "धरम खंड का एहो धरमु ॥" },
        { index: 1, text: "गिआन खंड का आखहु करमु ॥" },
        { index: 2, text: "केते पवण पाणी वैसंतर केते कान महेस ॥" },
        { index: 3, text: "केते बरमे घाड़ति घड़ीअहि रूप रंग के वेस ॥" },
        { index: 4, text: "केतीआ करम भूमी मेर केते केते धू उपदेस ॥" },
        { index: 5, text: "केते इंद चंद सूर केते केते मंडल देस ॥" },
        { index: 6, text: "केते सिध बुध नाथ केते केते देवी वेस ॥" },
        { index: 7, text: "केते देव दानव मुनि केते केते रतन समुंद ॥" },
        { index: 8, text: "केतीआ खाणी केतीआ बाणी केते पात नरिंद ॥" },
        { index: 9, text: "केतीआ सुरती सेवक केते नानक अंतु न अंतु ॥३५॥" },
        { index: 10, text: "गिआन खंड महि गिआनु परचंडु ॥" },
        { index: 11, text: "तिथै नाद बिनोद कोड अनंदु ॥" },
        { index: 12, text: "सरम खंड की बाणी रूपु ॥" },
        { index: 13, text: "तिथै घाड़ति घड़ीऐ बहुतु अनूपु ॥" },
        { index: 14, text: "ता कीआ गला कथीआ ना जाहि ॥" },
        { index: 15, text: "जे को कहै पिछै पछुताइ ॥" },
        { index: 16, text: "तिथै घड़ीऐ सुरति मति मनि बुधि ॥" },
        { index: 17, text: "तिथै घड़ीऐ सुरा सिधा की सुधि ॥३६॥" },
        { index: 18, text: "करम खंड की बाणी जोरु ॥" },
        { index: 19, text: "तिथै होरु न कोई होरु ॥" },
        { index: 20, text: "तिथै जोध महाबल सूर ॥" },
        { index: 21, text: "तिन महि रामु रहिआ भरपूर ॥" },
        { index: 22, text: "तिथै सीतो सीता महिमा माहि ॥" },
        { index: 23, text: "ता के रूप न कथने जाहि ॥" },
        { index: 24, text: "ना ओहि मरहि न ठागे जाहि ॥" },
        { index: 25, text: "जिन कै रामु वसै मन माहि ॥" },
        { index: 26, text: "तिथै भगत वसहि के लोअ ॥" },
        { index: 27, text: "करहि अनंदु सचा मनि सोइ ॥" },
        { index: 13, text: "सच खंडि वसै निरंकारु ॥" },
        { index: 1, text: "करि करि वेखै नदरि निहाल ॥" },
        { index: 2, text: "तिथै खंड मंडल वरभंड ॥" },
        { index: 3, text: "जे को कथै त अंत न अंत ॥" },
        { index: 4, text: "तिथै लोअ लोअ आकार ॥" },
        { index: 5, text: "जिव जिव हुकमु तिवै तिव कार ॥" },
        { index: 6, text: "वेखै विगसै करि वीचारु ॥" },
        { index: 7, text: "नानक कथना करड़ा सारु ॥३७॥" },
        { index: 8, text: "जतु पाहारा धीरजु सुनिआरु ॥" },
        { index: 9, text: "अहरणि मति वेदु हथीआरु ॥" },
        { index: 10, text: "भउ खला अगनि तप ताउ ॥" },
        { index: 11, text: "भांडा भाउ अम्रितु तितु ढालि ॥" },
        { index: 12, text: "घड़ीऐ सबदु सची टकसाल ॥" },
        { index: 13, text: "जिन कउ नदरि करमु तिन कार ॥" },
        { index: 14, text: "नानक नदरी नदरि निहाल ॥३८॥" },
        { index: 15, text: "सलोकु ॥" },
        { index: 16, text: "पवणु गुरू पाणी पिता माता धरति महतु ॥" },
        { index: 17, text: "दिवसु राति दुइ दाई दाइआ खेलै सगल जगतु ॥" },
        { index: 18, text: "चंगिआईआ बुरिआईआ वाचै धरमु हदूरि ॥" },
        { index: 19, text: "करमी आपो आपणी के नेड़ै के दूरि ॥" },
        { index: 20, text: "जिनी नामु धिआइआ गए मसकति घालि ॥" },
        { index: 21, text: "नानक ते मुख उजले केती छुटी नालि ॥१॥" }])
  
      setHighlightIndex(0)
    } else if (name === "JaapSahib") {
      settext([{ index: 1, text: "स्री वाहिगुरू जी की फ़तह ॥" }
        , { index: 2, text: "जापु ॥" }
        , { index: 3, text: "स्री मुखवाक पातिसाही १० ॥" }
        , { index: 4, text: "छपै छंद ॥ त्वप्रसादि ॥" }
        , { index: 5, text: "च्क्र चिहन अरु बरन जाति अरु पाति नहिन जिह ॥" }
        , { index: 6, text: "रूप रंग अरु रेख भेख कोऊ कहि न सकति किह ॥" }
        , { index: 7, text: "अचल मूरति अनभउ प्रकास अमितोजि कहिजै ॥" }
        , { index: 8, text: "कोटि इंद्र इंद्राणि साहु साहाणि गणिजै ॥" }
        , { index: 9, text: "त्रिभवण महीप सुर नर असुर नेति नेति बन त्रिण कहत ॥" }
        , { index: 10, text: "त्व सरब नाम कथै कवन करम नाम बरणत सुमति ॥१॥" }
        , { index: 11, text: "भुजंग प्रयात छंद ॥ नमसत्वं अकाले ॥" }
        , { index: 12, text: "नमसत्वं क्रिपाले ॥ नमसत्वं अरूपे ॥" }
        , { index: 13, text: "नमसत्वं अनूपे ॥२॥" }
        , { index: 14, text: "नमसतं अभेखे ॥ नमसतं अलेखे ॥" }
        , { index: 15, text: "नमसतं अकाए ॥ नमसतं अजाए ॥३॥" }
        , { index: 16, text: "नमसतं अगंजे ॥ नमसतं अभंजे ॥" }
        , { index: 17, text: "नमसतं अनामे ॥ नमसतं अठामे ॥४॥" }
        , { index: 18, text: "नमसतं अकरमं ॥ नमसतं अधरमं ॥" }
        , { index: 19, text: "नमसतं अनामं ॥ नमसतं अधामं ॥५॥" }
        , { index: 20, text: "नमसतं अजीते ॥ नमसतं अभीते ॥" }
        , { index: 21, text: "नमसतं अबाहे ॥ नमसतं अढाहे ॥६॥" }
        , { index: 22, text: "नमसतं अनीले ॥ नमसतं अनादे ॥" }
        , { index: 23, text: "नमसतं अछेदे ॥ नमसतं अगाधे ॥७॥" }
        , { index: 24, text: "नमसतं अगंजे ॥ नमसतं अभंजे ॥" }
        , { index: 25, text: "नमसतं उदारे ॥ नमसतं अपारे ॥८॥" }
        , { index: 26, text: "नमसतं सु एकै ॥ नमसतं अनेकै ॥" }
        , { index: 27, text: "नमसतं अभूते ॥ नमसतं अजूपे ॥९॥" }
        , { index: 14, text: "नमसतं न्रिकरमे ॥ नमसतं न्रिभरमे ॥" }
        , { index: 1, text: "नमसतं न्रिदेसे ॥ नमसतं न्रिभेसे ॥१०॥" }
        , { index: 2, text: "नमसतं न्रिनामे ॥ नमसतं न्रिकामे ॥" }
        , { index: 3, text: "नमसतं न्रिधाते ॥ नमसतं न्रिघाते ॥११॥" }
        , { index: 4, text: "नमसतं न्रिधूते ॥ नमसतं अभूते ॥" }
        , { index: 5, text: "नमसतं अलोके ॥ नमसतं असोके ॥१२॥" }
        , { index: 6, text: "नमसतं न्रितापे ॥ नमसतं अथापे ॥" }
        , { index: 7, text: "नमसतं त्रिमाने ॥ नमसतं निधाने ॥१३॥" }
        , { index: 8, text: "नमसतं अगाहे ॥ नमसतं अबाहे ॥" }
        , { index: 9, text: "नमसतं त्रिबरगे ॥ नमसतं असरगे ॥१४॥" }
        , { index: 10, text: "नमसतं प्रभोगे ॥ नमसतं सुजोगे ॥" }
        , { index: 11, text: "नमसतं अरंगे ॥ नमसतं अभंगे ॥१५॥" }
        , { index: 12, text: "नमसतं अगमे ॥ नमसतसतु रमे ॥" }
        , { index: 13, text: "नमसतं जलासरे ॥ नमसतं निरासरे ॥१६॥" }
        , { index: 14, text: "नमसतं अजाते ॥ नमसतं अपाते ॥" }
        , { index: 15, text: "नमसतं अमजबे ॥ नमसतसतु अजबे ॥१७॥" }
        , { index: 16, text: "अदेसं अदेसे ॥ नमसतं अभेसे ॥" }
        , { index: 17, text: "नमसतं न्रिधामे ॥ नमसतं न्रिबामे ॥१८॥" }
        , { index: 18, text: "नमो सरब काले ॥ नमो सरब दिआले ॥" }
        , { index: 19, text: "नमो सरब रूपे ॥ नमो सरब भूपे ॥१९॥" }
        , { index: 20, text: "नमो सरब खापे ॥ नमो सरब थापे ॥" }
        , { index: 21, text: "नमो सरब काले ॥ नमो सरब पाले ॥२०॥" }
        , { index: 22, text: "नमसतसतु देवै ॥ नमसतं अभेवै ॥" }
        , { index: 23, text: "नमसतं अजनमे ॥ नमसतं सुबनमे ॥२१॥" }
        , { index: 24, text: "नमो सरब गउने ॥ नमो सरब भउने ॥" }
        , { index: 25, text: "नमो सरब रंगे ॥ नमो सरब भंगे ॥२२॥" }
        , { index: 26, text: "नमो काल काले ॥ नमसतसतु दिआले ॥" }
        , { index: 27, text: "नमसतं अबरने ॥ नमसतं अमरने ॥२३॥" }
        , { index: 14, text: "नमसतं जरारं ॥ नमसतं क्रितारं ॥" }
        , { index: 14, text: "नमो सरब धंधे ॥ नमो सत अबंधे ॥२४॥" }
        , { index: 1, text: "नमसतं न्रिसाके ॥ नमसतं न्रिबाके ॥" }
        , { index: 2, text: "नमसतं रहीमे ॥ नमसतं करीमे ॥२५॥" }
        , { index: 3, text: "नमसतं अनंते ॥ नमसतं महंते ॥" }
        , { index: 4, text: "नमसतसतु रागे ॥ नमसतं सुहागे ॥२६॥" }
        , { index: 5, text: "नमो सरब सोखं ॥ नमो सरब पोखं ॥" }
        , { index: 6, text: "नमो सरब करता ॥ नमो सरब हरता ॥२७॥" }
        , { index: 7, text: "नमो जोग जोगे ॥ नमो भोग भोगे ॥" }
        , { index: 8, text: "नमो सरब दिआले ॥ नमो सरब पाले ॥२८॥" }
        , { index: 9, text: "चाचरी छंद ॥ त्वप्रसादि ॥" }
        , { index: 10, text: "अरूप हैं ॥ अनूप हैं ॥" }
        , { index: 11, text: "अजू हैं ॥ अभू हैं ॥२९॥" }
        , { index: 12, text: "अलेख हैं ॥ अभेख हैं ॥" }
        , { index: 13, text: "अनाम हैं ॥ अकाम हैं ॥३०॥" }
        , { index: 14, text: "अधे हैं ॥ अभे हैं ॥" }
        , { index: 15, text: "अजीत हैं ॥ अभीत हैं ॥३१॥" }
        , { index: 16, text: "त्रिमान हैं ॥ निधान हैं ॥" }
        , { index: 17, text: "त्रिबरग है ॥ असरग हैं ॥३२॥" }
        , { index: 18, text: "अनील हैं ॥ अनादि हैं ॥" }
        , { index: 19, text: "अजे हैं ॥ अजादि हैं ॥३३॥" }
        , { index: 20, text: "अजनम हैं ॥ अबरन हैं ॥" }
        , { index: 21, text: "अभूत हैं ॥ अभरन हैं ॥३४॥" }
        , { index: 22, text: "अगंज हैं ॥ अभंज हैं ॥" }
        , { index: 23, text: "अझूझ हैं ॥ अझंझ हैं ॥३५॥" }
        , { index: 24, text: "अमीक हैं ॥ रफ़ीक हैं ॥" }
        , { index: 25, text: "अधंध हैं ॥ अबंध हैं ॥३६॥" }
        , { index: 26, text: "न्रिबूझ हैं ॥ असूझ हैं ॥" }
        , { index: 27, text: "अकाल हैं ॥ अजाल हैं ॥३७॥" }
        , { index: 14, text: "अलाह हैं ॥ अजाह हैं ॥" }
        , { index: 1, text: "अनंत हैं ॥ महंत हैं ॥३८॥" }
        , { index: 2, text: "अलीक हैं ॥ न्रिस्रीक हैं ॥" }
        , { index: 3, text: "न्रिल्मभ हैं ॥ अस्मभ हैं ॥३९॥" }
        , { index: 4, text: "अगम हैं ॥ अजम हैं ॥" }
        , { index: 5, text: "अभूत हैं ॥ अछूत हैं ॥४०॥" }
        , { index: 6, text: "अलोक हैं ॥ असोक हैं ॥" }
        , { index: 7, text: "अकरम हैं ॥ अभरम हैं ॥४१॥" }
        , { index: 8, text: "अजीत हैं ॥ अभीत हैं ॥" }
        , { index: 9, text: "अबाह हैं ॥ अगाह हैं ॥४२॥" }
        , { index: 10, text: "अमान हैं ॥ निधान हैं ॥" }
        , { index: 11, text: "अनेक हैं ॥ फिरि एक हैं ॥४३॥" }
        , { index: 12, text: "भुजंग प्रयात छंद ॥ नमो सरब माने ॥" }
        , { index: 13, text: "समसती निधाने ॥ नमो देव देवे ॥" }
        , { index: 14, text: "अभेखी अभेवे ॥४४॥" }
        , { index: 15, text: "नमो काल काले ॥ नमो सरब पाले ॥" }
        , { index: 16, text: "नमो सरब गउणे ॥ नमो सरब भउणे ॥४५॥" }
        , { index: 17, text: "अनंगी अनाथे ॥ न्रिसंगी प्रमाथे ॥" }
        , { index: 18, text: "नमो भान भाने ॥ नमो मान माने ॥४६॥" }
        , { index: 19, text: "नमो चंद्र चंद्रे ॥ नमो भान भाने ॥" }
        , { index: 20, text: "नमो गीत गीते ॥ नमो तान ताने ॥४७॥" }
        , { index: 21, text: "नमो न्रि्त नि्रते ॥ नमो नाद नादे ॥" }
        , { index: 22, text: "नमो पान पाने ॥ नमो बाद बादे ॥४८॥" }
        , { index: 23, text: "अनंगी अनामे ॥ समसती सरूपे ॥" }
        , { index: 24, text: "प्रभंगी प्रमाथे ॥ समसती बिभूते ॥४९॥" }
        , { index: 25, text: "कलंकं बिना नेकलंकी सरूपे ॥" }
        , { index: 26, text: "नमो राज राजेस्वरं परम रूपे ॥५०॥" }
        , { index: 27, text: "नमो जोग जोगेस्वरं परम सि्धे ॥" }
        , { index: 14, text: "नमो राज राजेस्वरं परम ब्रिधे ॥५१॥" }
        , { index: 1, text: "नमो ससत्र पाणे ॥ नमो असत्र माणे ॥" }
        , { index: 2, text: "नमो परम गिआता ॥ नमो लोक माता ॥५२॥" }
        , { index: 3, text: "अभेखी अभरमी अभोगी अभुगते ॥" }
        , { index: 4, text: "नमो जोग जोगेस्वरं परम जुगते ॥५३॥" }
        , { index: 5, text: "नमो नि्त नाराइणे करूर करमे ॥" }
        , { index: 6, text: "नमो प्रेत अप्रेत देवे सुधरमे ॥५४॥" }
        , { index: 7, text: "नमो रोग हरता ॥ नमो राग रूपे ॥" }
        , { index: 8, text: "नमो साह साहं ॥ नमो भूप भूपे ॥५५॥" }
        , { index: 9, text: "नमो दान दाने ॥ नमो मान माने ॥" }
        , { index: 10, text: "नमो रोग रोगे ॥ नमसतं सनाने ॥५६॥" }
        , { index: 11, text: "नमो मंत्र मंत्रं ॥ नमो जंत्र जंत्रं ॥" }
        , { index: 12, text: "नमो इसट इसटे ॥ नमो तंत्र तंत्रं ॥५७॥" }
        , { index: 13, text: "सदा स्चदानंद सरबं प्रणासी ॥" }
        , { index: 14, text: "अनूपे अरूपे समसतुल निवासी ॥५८॥" }
        , { index: 15, text: "सदा सिधिदा बुधिदा ब्रिधि करता ॥" }
        , { index: 16, text: "अधो उरध अरधं अघं ओघ हरता ॥५९॥" }
        , { index: 17, text: "परं परम परमेस्वरं प्रोछ पालं ॥" }
        , { index: 18, text: "सदा सरबदा सिधि दाता दिआलं ॥६०॥" }
        , { index: 19, text: "अछेदी अभेदी अनामं अकामं ॥" }
        , { index: 20, text: "समसतो पराजी समसतसतु धामं ॥६१॥" }
        , { index: 21, text: "तेरा जोरु ॥ चाचरी छंद ॥ जले हैं ॥" }
        , { index: 22, text: "थले हैं ॥ अभीत हैं ॥ अभे हैं ॥६२॥" }
        , { index: 23, text: "प्रभू हैं ॥ अजू हैं ॥" }
        , { index: 24, text: "अदेस हैं ॥ अभेस हैं ॥६३॥" }
        , { index: 25, text: "भुजंग प्रयात छंद ॥" }
        , { index: 26, text: "अगाधे अबाधे ॥ अनंदी सरूपे ॥" }
        , { index: 27, text: "नमो सरब माने ॥ समसती निधाने ॥६४॥" }
        , { index: 14, text: "नमसत्वं न्रिनाथे ॥ नमसत्वं प्रमाथे ॥" }
        , { index: 1, text: "नमसत्वं अगंजे ॥ नमसत्वं अभंजे ॥६५॥" }
        , { index: 2, text: "नमसत्वं अकाले ॥ नमसत्वं अपाले ॥" }
        , { index: 3, text: "नमो सरब देसे ॥ नमो सरब भेसे ॥६६॥" }
        , { index: 4, text: "नमो राज राजे ॥ नमो साज साजे ॥" }
        , { index: 5, text: "नमो साह साहे ॥ नमो माह माहे ॥६७॥" }
        , { index: 6, text: "नमो गीत गीते ॥ नमो प्रीति प्रीते ॥" }
        , { index: 7, text: "नमो रोख रोखे ॥ नमो सोख सोखे ॥६८॥" }
        , { index: 8, text: "नमो सरब रोगे ॥ नमो सरब भोगे ॥" }
        , { index: 9, text: "नमो सरब जीतं ॥ नमो सरब भीतं ॥६९॥" }
        , { index: 10, text: "नमो सरब गिआनं ॥ नमो परम तानं ॥" }
        , { index: 11, text: "नमो सरब मंत्रं ॥ नमो सरब जंत्रं ॥७०॥" }
        , { index: 12, text: "नमो सरब द्रि्सं ॥ नमो सरब क्रि्सं ॥" }
        , { index: 13, text: "नमो सरब रंगे ॥ त्रिभंगी अनंगे ॥७१॥" }
        , { index: 14, text: "नमो जीव जीवं ॥ नमो बीज बीजे ॥" }
        , { index: 15, text: "अखि्जे अभि्जे ॥ समसतं प्रसि्जे ॥७२॥" }
        , { index: 16, text: "क्रिपालं सरूपे ॥ कुकरमं प्रणासी ॥" }
        , { index: 17, text: "सदा सरबदा रिधि सिधं निवासी ॥७३॥" }
        , { index: 18, text: "चरपट छंद ॥ त्वप्रसादि ॥" }
        , { index: 19, text: "अम्रित करमे ॥ अमब्रित धरमे ॥" }
        , { index: 20, text: "अखिल जोगे ॥ अचल भोगे ॥७४॥" }
        , { index: 21, text: "अचल राजे ॥ अटल साजे ॥" }
        , { index: 22, text: "अखल धरमं ॥ अलख करमं ॥७५॥" }
        , { index: 23, text: "सरबं दाता ॥ सरबं गिआता ॥" }
        , { index: 24, text: "सरबं भाने ॥ सरबं माने ॥७६॥" }
        , { index: 25, text: "सरबं प्राणं ॥ सरबं त्राणं ॥" }
        , { index: 26, text: "सरबं भुगता ॥ सरबं जुगता ॥७७॥" }
        , { index: 27, text: "सरबं देवं ॥ सरबं भेवं ॥" }
        , { index: 14, text: "सरबं काले ॥ सरबं पाले ॥७८॥" }
        , { index: 1, text: "रूआल छंद ॥ त्वप्रसादि ॥" }
        , { index: 2, text: "आदि रूप अनादि मूरति अजोनि पुरख अपार ॥" }
        , { index: 3, text: "सरब मान त्रिमान देव अभेव आदि उदार ॥" }
        , { index: 4, text: "सरब पालक सरब घालक सरब को पुनि काल ॥" }
        , { index: 5, text: "ज्त्र त्त्र बिराजही अवधूत रूप रिसाल ॥७९॥" }
        , { index: 6, text: "नाम ठाम न जाति जाकर रूप रंग न रेख ॥" }
        , { index: 7, text: "आदि पुरख उदार मूरति अजोनि आदि असेख ॥" }
        , { index: 8, text: "देस अउर न भेस जाकर रूप रेख न राग ॥" }
        , { index: 9, text: "जत्र तत्र दिसा विसा हुइ फैलिओ अनुराग ॥८०॥" }
        , { index: 10, text: "नाम काम बिहीन पेखत धाम हूं नहि जाहि ॥" }
        , { index: 11, text: "सरब मान सरब्त्र मान सदैव मानत ताहि ॥" }
        , { index: 12, text: "एक मूरति अनेक दरसन कीन रूप अनेक ॥" }
        , { index: 13, text: "खेल खेलि अखेल खेलन अंत को फिरि एक ॥८१॥" }
        , { index: 14, text: "देव भेव न जानही जिह बेद अउर कतेब ॥" }
        , { index: 15, text: "रूप रंग न जाति पाति सु जानई किह जेब ॥" }
        , { index: 16, text: "तात मात न जात जाकर जनम मरन बिहीन ॥" }
        , { index: 17, text: "च्क्र ब्क्र फिरै चतुर चकि मान ही पुर तीन ॥८२॥" }
        , { index: 18, text: "लोक चउदह के बिखै जग जाप ही जिह जापु ॥" }
        , { index: 19, text: "आदि देव अनादि मूरति थापिओ सबै जिह थापु ॥" }
        , { index: 20, text: "परम रूप पुनीत मूरति पूरन पुरख अपार ॥" }
        , { index: 21, text: "सरब बिस्व रचिओ सुय्मभव गड़न भंजनहार ॥८३॥" }
        , { index: 22, text: "काल हीन कला संजुगति अकाल पुरख अदेस ॥" }
        , { index: 23, text: "धरम धाम सु भरम रहत अभूत अलख अभेस ॥" }
        , { index: 24, text: "अंग राग न रंग जा कहि जाति पाति न नाम ॥" }
        , { index: 25, text: "गरब गंजन दुसट भंजन मुकति दाइक काम ॥८४॥" }
        , { index: 26, text: "आप रूप अमीक अनउसतति एक पुरख अवधूत ॥" }
        , { index: 27, text: "गरब गंजन सरब भंजन आदि रूप असूत ॥" }
        , { index: 14, text: "अंह हीन अभंग अनातम एक पुरख अपार ॥" }
        , { index: 1, text: "सरब लाइक सरब घाइक सरब को प्रतिपार ॥८५॥" }
        , { index: 2, text: "सरब गंता सरब हंता सरब ते अनभेख ॥" }
        , { index: 3, text: "सरब सासत्र न जानही जिह रूप रंगु अरु रेख ॥" }
        , { index: 4, text: "परम बेद पुराण जाकहि नेति भाखत नित ॥" }
        , { index: 5, text: "कोटि सिम्रित पुरान सासत्र न आवई वहु चि्त ॥८६॥" }
        , { index: 6, text: "मधुभार छंद ॥ त्वप्रसादि ॥" }
        , { index: 7, text: "गुन गन उदार ॥ महिमा अपार ॥" }
        , { index: 8, text: "आसन अभंग ॥ उपमा अनंग ॥८७॥" }
        , { index: 9, text: "अनभउ प्रकास ॥ निस दिन अनास ॥" }
        , { index: 10, text: "आजानु बाहु ॥ साहानु साहु ॥८८॥" }
        , { index: 11, text: "राजान राज ॥ भानान भान ॥" }
        , { index: 12, text: "देवान देव ॥ उपमा महान ॥८९॥" }
        , { index: 13, text: "इंद्रान इंद्र ॥ बालान बाल ॥" }
        , { index: 14, text: "रंकान रंक ॥ कालान काल ॥९०॥" }
        , { index: 15, text: "अनभूत अंग ॥ आभा अभंग ॥" }
        , { index: 16, text: "गति मिति अपार ॥ गुन गन उदार ॥९१॥" }
        , { index: 17, text: "मुनि गन प्रनाम ॥ निरभै निकाम ॥" }
        , { index: 18, text: "अति दुति प्रचंड ॥ मित गति अखंड ॥९२॥" }
        , { index: 19, text: "आलिस्य करम ॥ आद्रिस्य धरम ॥" }
        , { index: 20, text: "सरबा भरणाढय ॥ अनडंड बाढय ॥९३॥" }
        , { index: 21, text: "चाचरी छंद ॥ त्वप्रसादि ॥" }
        , { index: 22, text: "गुबिंदे ॥ मुकंदे ॥ उदारे ॥ अपारे ॥९४॥" }
        , { index: 23, text: "हरीअं ॥ करीअं ॥ न्रिनामे ॥ अकामे ॥९५॥" }
        , { index: 24, text: "भुजंग प्रयात छंद ॥ च्त्र च्क्र करता ॥" }
        , { index: 25, text: "च्त्र च्क्र हरता ॥ च्त्र च्क्र दाने ॥" }
        , { index: 26, text: "च्त्र च्क्र जाने ॥९६॥" }
        , { index: 27, text: "च्त्र च्क्र वरती ॥ च्त्र च्क्र भरती ॥" }
        , { index: 14, text: "च्त्र च्क्र पाले ॥ च्त्र च्क्र काले ॥९७॥" }
        , { index: 1, text: "च्त्र च्क्र पासे ॥ च्त्र च्क्र वासे ॥" }
        , { index: 2, text: "च्त्र च्क्र मानयै ॥ च्त्र च्क्र दानयै ॥९८॥" }
        , { index: 3, text: "चाचरी छंद ॥" }
        , { index: 4, text: "न स्त्रै ॥ न मि्त्रै ॥ न भरमं ॥ न भि्त्रै ॥९९॥" }
        , { index: 5, text: "न करमं ॥ न काए ॥ अजनमं ॥ अजाए ॥१००॥" }
        , { index: 6, text: "न चि्त्रै ॥ न मि्त्रै ॥ परे हैं ॥ पवि्त्रै ॥१०१॥" }
        , { index: 7, text: "प्रिथीसै ॥ अदीसै ॥ अद्रिसै ॥ अक्रिसै ॥१०२॥" }
        , { index: 8, text: "भगवती छंद ॥ त्वप्रसादि कथते ॥" }
        , { index: 9, text: "कि आछि्ज देसै ॥ कि आभि्ज भेसै ॥" }
        , { index: 10, text: "कि आगंज करमै ॥ कि आभंज भरमै ॥१०३॥" }
        , { index: 11, text: "कि आभिज लोकै ॥ कि आदित सोकै ॥" }
        , { index: 12, text: "कि अवधूत बरनै ॥ कि बिभूत करनै ॥१०४॥" }
        , { index: 13, text: "कि राजं प्रभा हैं ॥ कि धरमं धुजा हैं ॥" }
        , { index: 14, text: "कि आसोक बरनै ॥ कि सरबा अभरनै ॥१०५॥" }
        , { index: 15, text: "कि जगतं क्रिती हैं ॥ कि छत्रं छत्री हैं ॥" }
        , { index: 16, text: "कि ब्रहमं सरूपै ॥ कि अनभउ अनूपै ॥१०६॥" }
        , { index: 17, text: "कि आदि अदेव हैं ॥ कि आपि अभेव हैं ॥" }
        , { index: 18, text: "कि चि्त्रं बिहीनै ॥ कि एकै अधीनै ॥१०७॥" }
        , { index: 19, text: "कि रोजी रजाकै ॥ रहीमै रिहाकै ॥" }
        , { index: 20, text: "कि पाक बिऐब हैं ॥ कि गैबुल ग़ैब हैं ॥१०८॥" }
        , { index: 21, text: "कि अफवुल गुनाह हैं ॥ कि शाहान शाह हैं ॥" }
        , { index: 22, text: "कि कारन कुनिंद हैं ॥ कि रोज़ी दिहिंद हैं ॥१०९॥" }
        , { index: 23, text: "कि राज़क रहीम हैं ॥ कि करमं करीम हैं ॥" }
        , { index: 24, text: "कि सरबं कली हैं ॥ कि सरबं दली हैं ॥११०॥" }
        , { index: 25, text: "कि सरब्त्र मानियै ॥ कि सरब्त्र दानियै ॥" }
        , { index: 26, text: "कि सरब्त्र गउनै ॥ कि सरब्त्र भउनै ॥१११॥" }
        , { index: 27, text: "कि सरब्त्र देसै ॥ कि सरब्त्र भेसै ॥" }
        , { index: 14, text: "कि सरब्त्र राजै ॥ कि सरब्त्र साजै ॥११२॥" }
        , { index: 1, text: "कि सरब्त्र दीनै ॥ कि सरब्त्र लीनै ॥" }
        , { index: 2, text: "कि सरब्त्र जाहो ॥ कि सरब्त्र भाहो ॥११३॥" }
        , { index: 3, text: "कि सरब्त्र देसै ॥ कि सरब्त्र भेसै ॥" }
        , { index: 4, text: "कि सरब्त्र कालै ॥ कि सरब्त्र पालै ॥११४॥" }
        , { index: 5, text: "कि सरब्त्र हंता ॥ कि सरब्त्र गंता ॥" }
        , { index: 6, text: "कि सरब्त्र भेखी ॥ कि सरब्त्र पेखी ॥११५॥" }
        , { index: 7, text: "कि सरब्त्र काजै ॥ कि सरब्त्र राजै ॥" }
        , { index: 8, text: "कि सरब्त्र सोखै ॥ कि सरब्त्र पोखै ॥११६॥" }
        , { index: 9, text: "कि सरब्त्र त्राणै ॥ कि सरब्त्र प्राणै ॥" }
        , { index: 10, text: "कि सरब्त्र देसै ॥ कि सरब्त्र भेसै ॥११७॥" }
        , { index: 11, text: "कि सरब्त्र मानियैं ॥ सदैवं प्रधानियैं ॥" }
        , { index: 12, text: "कि सरब्त्र जापियै ॥ कि सरब्त्र थापियै ॥११८॥" }
        , { index: 13, text: "कि सरब्त्र भानै ॥ कि सरब्त्र मानै ॥" }
        , { index: 14, text: "कि सरब्त्र इंद्रै ॥ कि सरब्त्र चंद्रै ॥११९॥" }
        , { index: 15, text: "कि सरबं कलीमै ॥ कि परमं फ़हीमै ॥" }
        , { index: 16, text: "कि आकिल अलामै ॥ कि साहिब कलामै ॥१२०॥" }
        , { index: 17, text: "कि हुसनल वजू हैं ॥ तमामुल रुजू हैं ॥" }
        , { index: 18, text: "हमेसुल सलामै ॥ सलीखत मुदामैं ॥१२१॥" }
        , { index: 19, text: "ग़नीमुल शिकसतै ॥ गरीबुल परसतै ॥" }
        , { index: 20, text: "बिलंदुल मकानै ॥ ज़मीनुल ज़मानै ॥१२२॥" }
        , { index: 21, text: "तमीज़ुल तमामैं ॥ रुजूअल निधानैं ॥" }
        , { index: 22, text: "हरीफ़ुल अजीमैं ॥ रज़ाइक यकीनै ॥१२३॥" }
        , { index: 23, text: "अनेकुल तरंग हैं ॥ अभेद हैं अभंग हैं ॥" }
        , { index: 24, text: "अज़ीज़ुल निवाज़ हैं ॥ ग़नीमुल खिराज हैं ॥१२४॥" }
        , { index: 25, text: "निरुकत सरूप हैं ॥ त्रिमुकति बिभूत हैं ॥" }
        , { index: 26, text: "प्रभुगति प्रभा हैं ॥ सुजुगति सुधा हैं ॥१२५॥" }
        , { index: 27, text: "सदैवं सरूप हैं ॥ अभेदी अनूप हैं ॥" }
        , { index: 14, text: "समसतो पराज हैं ॥ सदा सरब साज हैं ॥१२६॥" }
        , { index: 1, text: "समसतुल सलाम हैं ॥ सदैवल अकाम हैं ॥" }
        , { index: 2, text: "न्रिबाध सरूप हैं ॥ अगाध हैं अनूप हैं ॥१२७॥" }
        , { index: 3, text: "ओअं आदि रूपे ॥ अनादि सरूपै ॥" }
        , { index: 4, text: "अनंगी अनामे ॥ त्रिभंगी त्रिकामे ॥१२८॥" }
        , { index: 5, text: "त्रिबरगं त्रिबाधे ॥ अगंजे अगाधे ॥" }
        , { index: 6, text: "सुभं सरब भागे ॥ सु सरबा अनुरागे ॥१२९॥" }
        , { index: 7, text: "त्रिभुगत सरूप हैं ॥ अछि्ज हैं अछूत हैं ॥" }
        , { index: 8, text: "कि नरकं प्रणास हैं ॥ प्रिथीउल प्रवास हैं ॥१३०॥" }
        , { index: 9, text: "निरुकति प्रभा हैं ॥ सदैवं सदा हैं ॥" }
        , { index: 10, text: "बिभुगति सरूप है ॥ प्रजुगति अनूप हैं ॥१३१॥" }
        , { index: 11, text: "निरुकति सदा हैं ॥ बिभुगति प्रभा हैं ॥" }
        , { index: 12, text: "अनउकति सरूप हैं ॥ प्रजुगति अनूप हैं ॥१३२॥" }
        , { index: 13, text: "चाचरी छंद ॥ अभंग हैं ॥ अनंग हैं ॥" }
        , { index: 14, text: "अभेख हैं ॥ अलेख हैं ॥१३३॥" }
        , { index: 15, text: "अभरम हैं ॥ अकरम हैं ॥" }
        , { index: 16, text: "अनादि हैं ॥ जुगादि हैं ॥१३४॥" }
        , { index: 17, text: "अजै हैं ॥ अबै हैं ॥" }
        , { index: 18, text: "अभूत हैं ॥ अधूत हैं ॥१३५॥" }
        , { index: 19, text: "अनास हैं ॥ उदास हैं ॥" }
        , { index: 20, text: "अधंध हैं ॥ अबंध हैं ॥१३६॥" }
        , { index: 21, text: "अभगत हैं ॥ बिरकत हैं ॥" }
        , { index: 22, text: "अनास हैं ॥ प्रकास हैं ॥१३७॥" }
        , { index: 23, text: "निचिंत हैं ॥ सुनिंत हैं ॥" }
        , { index: 24, text: "अलि्ख हैं ॥ अदि्ख हैं ॥१३८॥" }
        , { index: 25, text: "अलेख हैं ॥ अभेख हैं ॥" }
        , { index: 26, text: "अढाह हैं ॥ अगाह हैं ॥१३९॥" }
        , { index: 27, text: "अस्मभ हैं ॥ अग्मभ हैं ॥" }
        , { index: 14, text: "अनील हैं ॥ अनादि हैं ॥१४०॥" }
        , { index: 1, text: "अनित हैं ॥ सुनित हैं ॥" }
        , { index: 2, text: "अजात हैं ॥ अजादि हैं ॥१४१॥" }
        , { index: 3, text: "चरपट छंद ॥ त्वप्रसादि ॥" }
        , { index: 4, text: "सरबं हंता ॥ सरब गंता ॥" }
        , { index: 5, text: "सरबं खिआता ॥ सरबं गिआता ॥१४२॥" }
        , { index: 6, text: "सरबं हरता ॥ सरबं करता ॥" }
        , { index: 7, text: "सरबं प्राणं ॥ सरबं त्राणं ॥१४३॥" }
        , { index: 8, text: "सरबं करमं ॥ सरबं धरमं ॥" }
        , { index: 9, text: "सरबं जुगता ॥ सरबं मुकता ॥१४४॥" }
        , { index: 10, text: "रसावल छंद ॥ त्वप्रसादि ॥" }
        , { index: 11, text: "नमो नरक नासे ॥ सदैवं प्रकासे ॥" }
        , { index: 12, text: "अनंगं सरूपे ॥ अभंगं बिभूते ॥१४५॥" }
        , { index: 13, text: "प्रमाथं प्रमाथे ॥ सदा सरब साथे ॥" }
        , { index: 14, text: "अगाध सरूपे ॥ न्रिबाध बिभूते ॥१४६॥" }
        , { index: 15, text: "अनंगी अनामे ॥" }
        , { index: 16, text: "त्रिभंगी त्रिकामे ॥" }
        , { index: 17, text: "न्रिभंगी सरूपे ॥" }
        , { index: 18, text: "सरबंगी अनूपे ॥१४७॥" }
        , { index: 19, text: "न पोत्रै न पुत्रै ॥ न सत्रै न मित्रै ॥" }
        , { index: 20, text: "न तातै न मातै ॥ न जातै न पातै ॥१४८॥" }
        , { index: 21, text: "न्रिसाकं सरीक हैं ॥ अमितो अमीक हैं ॥" }
        , { index: 22, text: "सदैवं प्रभा हैं ॥ अजै हैं अजा हैं ॥१४९॥" }
        , { index: 23, text: "भगवती छंद ॥ त्वप्रसादि ॥" }
        , { index: 24, text: "कि ज़ाहिर ज़हूर हैं ॥ कि हाज़िर हज़ूर हैं ॥" }
        , { index: 25, text: "हमेसुल सलाम हैं ॥ समसतुल कलाम हैं ॥१५०॥" }
        , { index: 26, text: "कि साहिब दिमाग हैं ॥ कि हुसनल चराग हैं ॥" }
        , { index: 27, text: "कि कामल करीम हैं ॥ कि राज़क रहीम हैं ॥१५१॥" }
        , { index: 14, text: "कि रोज़ी दिहिंद हैं ॥ कि राज़क रहिंद हैं ॥" }
        , { index: 1, text: "करीमुल कमाल हैं ॥ कि हुसनल जमाल हैं ॥१५२॥" }
        , { index: 2, text: "ग़नीमुल ख़िराज हैं ॥ ग़रीबुल निवाज़ हैं ॥" }
        , { index: 3, text: "हरफ़िुल शिकंन हैं ॥ हिरासुल फिकंन हैं ॥१५३॥" }
        , { index: 4, text: "कलंकं प्रणास हैं ॥ समसतुल निवास हैं ॥" }
        , { index: 5, text: "अगंजुल गनीम हैं ॥ रजाइक रहीम हैं ॥१५४॥" }
        , { index: 6, text: "समसतुल जुबां हैं ॥ कि साहिब किरां हैं ॥" }
        , { index: 7, text: "कि नरकं प्रणास हैं ॥ बहिसतुल निवास हैं ॥१५५॥" }
        , { index: 8, text: "कि सरबुल गवंन हैं ॥ हमेसुल रवंन हैं ॥" }
        , { index: 9, text: "तमामुल तमीज हैं ॥ समसतुल अजीज हैं ॥१५६॥" }
        , { index: 10, text: "परं परम ईस हैं ॥" }
        , { index: 11, text: "समसतुल अदीस हैं ॥" }
        , { index: 12, text: "अदेसुल अलेख हैं ॥" }
        , { index: 13, text: "हमेसुल अभेख हैं ॥१५७॥" }
        , { index: 14, text: "ज़मीनुल ज़मां हैं ॥ अमीकुल इमां हैं ॥" }
        , { index: 15, text: "करीमुल कमाल हैं ॥ कि जुरअति जमाल हैं ॥१्हू५८॥" }
        , { index: 16, text: "कि अचलं प्रकास हैं ॥ कि अमितो सुबास हैं ॥" }
        , { index: 17, text: "कि अजब सरूप हैं ॥ कि अमितो बिभुूत हैं ॥१५९॥" }
        , { index: 18, text: "कि अमितो पसा हैं ॥ कि आतम प्रभा हैं ॥" }
        , { index: 19, text: "कि अचलं अनंग हैं ॥ कि अमितो अभंग हैं ॥१६०॥" }
        , { index: 20, text: "मधुभार छंद ॥ त्वप्रसादि ॥ मुनि मनि प्रनाम ॥ गुनि गन मुदाम ॥" }
        , { index: 21, text: "अरि बर अगंज ॥ हरि नर प्रभंज ॥१६१॥" }
        , { index: 22, text: "अनगन प्रनाम ॥ मुनि मनि सलाम ॥" }
        , { index: 23, text: "हरि नर अखंड ॥ बर नर अमंड ॥१६२॥" }
        , { index: 24, text: "अनभव अनास ॥ मुनि मनि प्रकास ॥" }
        , { index: 25, text: "गुनि गन प्रनाम ॥ जल थल मुदाम ॥१६३॥" }
        , { index: 26, text: "अनिछ्ज अंग ॥ आसन अभंग ॥" }
        , { index: 27, text: "उपमा अपार ॥ गति मिति उदार ॥१६४॥" }
        , { index: 14, text: "जल थल अमंड ॥ दिस विस अभंड ॥" }
        , { index: 1, text: "जल थल महंत ॥ दिस विस बिअंत ॥१६५॥" }
        , { index: 2, text: "अनभव अनास ॥ ध्रित धर धुरास ॥" }
        , { index: 3, text: "आजान बाहु ॥ एकै सदाहु ॥१६६॥" }
        , { index: 4, text: "ओअंकार आदि ॥ कथनी अनादि ॥" }
        , { index: 5, text: "खल खंड खिआल ॥ गुर बर अकाल ॥१६७॥" }
        , { index: 6, text: "घर घरि प्रनाम ॥ चित चरन नाम ॥" }
        , { index: 7, text: "अनिछ्ज गात ॥ आजिज न बात ॥१६८॥" }
        , { index: 8, text: "अनझंझ गात ॥ अनरंज बात ॥" }
        , { index: 9, text: "अनटुट भंडार ॥ अनठट अपार ॥१६९॥" }
        , { index: 10, text: "आडीठ धरम ॥ अति ढीठ करम ॥" }
        , { index: 11, text: "अणब्रण अनंत ॥ दाता महंत ॥१७०॥" }
        , { index: 12, text: "हरि बोल मना छंद ॥ त्वप्रसादि ॥" }
        , { index: 13, text: "करुणालय हैं ॥ अरि घालय हैं ॥" }
        , { index: 14, text: "खल खंडन हैं ॥ महि मंडन हैं ॥१७१॥" }
        , { index: 15, text: "जगतेस्वर हैं ॥ परमेस्वर हैं ॥" }
        , { index: 16, text: "कलि कारण हैं ॥ सरब उबारण हैं ॥१७२॥" }
        , { index: 17, text: "ध्रित के ध्रण हैं ॥ जग के क्रण हैं ॥" }
        , { index: 18, text: "मन मानिय हैं ॥ जग जानिय हैं ॥१७३॥" }
        , { index: 19, text: "सरबं भर हैं ॥ सरबं कर हैं ॥" }
        , { index: 20, text: "सरब पासिय हैं ॥ सरब नासिय हैं ॥१७४॥" }
        , { index: 21, text: "करुणाकर हैं ॥ बिस्व्मभर हैं ॥" }
        , { index: 22, text: "सरबेस्वर हैं ॥ जगतेस्वर हैं ॥१७५॥" }
        , { index: 23, text: "ब्रहमंडस हैं ॥ खल खंडस हैं ॥" }
        , { index: 24, text: "पर ते पर हैं ॥ करुणाकर हैं ॥१७६॥" }
        , { index: 25, text: "अजपा जप हैं ॥ अथपा थप हैं ॥" }
        , { index: 26, text: "अक्रिताक्रित हैं ॥ अम्रिताम्रित हैं ॥१७७॥" }
        , { index: 27, text: "अम्रिताम्रित हैं ॥ करुणाक्रित हैं ॥" }
        , { index: 14, text: "अक्रिताक्रत हैं ॥ धरणीध्रित हैं ॥१७८॥" }
        , { index: 1, text: "अम्रितेस्वर हैं ॥ परमेस्वर हैं ॥" }
        , { index: 2, text: "अक्रिताक्रित हैं ॥ अम्रिताम्रित हैं ॥१७९॥" }
        , { index: 3, text: "अजबाक्रित हैं ॥ अम्रिताअम्रित हैं ॥" }
        , { index: 4, text: "नर नाइक हैं ॥ खल घाइक हैं ॥१८०॥" }
        , { index: 5, text: "बिस्व्मभर हैं ॥ करुणालय हैं ॥" }
        , { index: 6, text: "न्रिप नाइक हैं ॥ सरब पाइक हैं ॥१८१॥" }
        , { index: 7, text: "भव भंजन हैं ॥ अरि गंजन हैं ॥" }
        , { index: 8, text: "रिपु तापन हैं ॥ जपु जापन हैं ॥१८२॥" }
        , { index: 9, text: "अकलंक्रित हैं ॥ सरबाक्रित हैं ॥" }
        , { index: 10, text: "करता कर हैं ॥ हरता हरि हैं ॥१८३॥" }
        , { index: 11, text: "परमातम हैं ॥ सरबातम हैं ॥" }
        , { index: 12, text: "आतम बस हैं ॥ जस के जस हैं ॥१८४॥" }
        , { index: 13, text: "भुजंग प्रयात छंद ॥" }
        , { index: 14, text: "नमो सूरज सुरजे नमो चंद्र चंद्रे ॥" }
        , { index: 15, text: "नमो राज राजे नमो इंद्र इंद्रे ॥" }
        , { index: 16, text: "नमो अंधकारे नमो तेज तेजे ॥" }
        , { index: 17, text: "नमो ब्रिंद ब्रिंदे नमो बीज बीजे ॥१८५॥" }
        , { index: 18, text: "नमो राजसं तामसं सांति रूपे ॥" }
        , { index: 19, text: "नमो परम त्तं अततं सरूपे ॥" }
        , { index: 20, text: "नमो जोग जोगे नमो गिआन गिआने ॥" }
        , { index: 21, text: "नमो मंत्र मंत्रे नमो धिआन धिआने ॥१८६॥" }
        , { index: 22, text: "नमो जुध जुधे नमो गिआन गिआने ॥" }
        , { index: 23, text: "नमो भोज भोजे नमो पान पाने ॥" }
        , { index: 24, text: "नमो कलह करता नमो सांति रूपे ॥" }
        , { index: 25, text: "नमो इंद्र इंद्रे अनादं बिभूते ॥१८७॥" }
        , { index: 26, text: "कलंकार रूपे अलंकार अलंके ॥" }
        , { index: 27, text: "नमो आस आसे नमो बांक बंके ॥" }
        , { index: 14, text: "अभंगी सरूपे अनंगी अनामे ॥" }
        , { index: 1, text: "त्रिभंगी त्रिकाले अनंगी अकामे ॥१८८॥" }
        , { index: 2, text: "एक अछरी छंद ॥" }
        , { index: 3, text: "अजै ॥ अलै ॥ अभै ॥ अबै ॥१८९॥" }
        , { index: 4, text: "अभू ॥ अजू ॥ अनास ॥ अकास ॥१९०॥" }
        , { index: 5, text: "अगंज ॥ अभंज ॥ अलख ॥ अभख ॥१९१॥" }
        , { index: 6, text: "अकाल ॥ दिआल ॥ अलेख ॥ अभेख ॥१९२॥" }
        , { index: 7, text: "अनाम ॥ अकाम ॥ अगाह ॥ अढाह ॥१९३॥" }
        , { index: 8, text: "अनाथे ॥ प्रमाथे ॥ अजोनी ॥ अमोनी ॥१९४॥" }
        , { index: 9, text: "न रागे ॥ न रंगे ॥ न रूपे ॥ न रेखे ॥१९५॥" }
        , { index: 10, text: "अकरमं ॥ अभरमं ॥ अगंजे ॥ अलेखे ॥१९६॥" }
        , { index: 11, text: "भुजंग प्रयात छंद ॥" }
        , { index: 12, text: "नमसतुल प्रणामे समसतुल प्रणासे ॥" }
        , { index: 13, text: "अगंजुल अनामे समसतुल निवासे ॥" }
        , { index: 14, text: "न्रिकामं बिभूते ॥ समसतुल सरूपे ॥" }
        , { index: 15, text: "कुकरमं प्रणासी सुधरमं बिभूते ॥१९७॥" }
        , { index: 16, text: "सदा स्चिदानंद स्त्रं प्रणासी ॥" }
        , { index: 17, text: "करीमुल कुनिंदा समसतुल निवासी ॥" }
        , { index: 18, text: "अजाइब बिभूते गजाइब गनीमे ॥" }
        , { index: 19, text: "हरीअं करीअं करीमुल रहीमे ॥१९८॥" }
        , { index: 20, text: "च्त्र च्क्र वरती च्त्र च्क्र भुगते ॥" }
        , { index: 21, text: "सुय्मभव सुभं सरबदा सरब जुगते ॥" }
        , { index: 22, text: "दुकालं प्रणासी दिआलं सरूपे ॥" }
        , { index: 23, text: "सदा अंग संगे अभंगं बिभूते ॥१९९" }])
      setHighlightIndex(0)
    }
    else if (name === "TavPrasadSavaiye") {
      settext([{
        index: 1, text: "त्वप्रसादि ॥ स्वये ॥"
      }, {
        index: 2, text: "स्रावग सु्ध समूह सिधान के देखि फिरिओ घर जोग जती के ॥"
      }, {
        index: 3, text: "सूर सुरारदन सु्ध सुधादिक संत समूह अनेक मती के ॥"
      }, {
        index: 4, text: "सारे ही देस को देखि रहिओ मत कोऊ न देखीअत प्रानपती के ॥"
      }, {
        index: 5, text: "स्री भगवान की भाइ क्रिपा हू ते एक रती बिनु एक रती के ॥१॥२१॥"
      }, {
        index: 6, text: "माते मतंग जरे जर संग अनूप उतंग सुरंग सवारे ॥"
      }, {
        index: 7, text: "कोट तुरंग कुरंग से कूदत पउन के गउन कउ जात निवारे ॥"
      }, {
        index: 8, text: "भारी भुजान के भूप भली बिधि निआवत सीस न जात बिचारे ॥"
      }, {
        index: 9, text: "एते भए तु कहा भए भूपति अंत कौ नांगे ही पांइ पधारे ॥२॥२२॥"
      }, {
        index: 10, text: "जीत फिरै सभ देस दिसान को बाजत ढोल म्रिदंग नगारे ॥"
      }, {
        index: 11, text: "गुंजत गूड़ गजान के सुंदर हिंसत हैं हयराज हजारे ॥"
      }, {
        index: 12, text: "भूत भवि्ख भवान के भूपत कउनु गनै नहीं जात बिचारे ॥"
      }, {
        index: 13, text: "स्री पति स्री भगवान भजे बिनु अंत कउ अंत के धाम सिधारे ॥३॥२३॥"
      }, {
        index: 14, text: "तीरथ नान दइआ दम दान सु संजम नेम अनेक बिसेखै ॥"
      }, {
        index: 15, text: "बेद पुरान कतेब कुरान जमीन जमान सबान के पेखै ॥"
      }, {
        index: 15, text: "पउन अहार जती जत धार सबै सु बिचार हजारक देखै ॥"
      }, {
        index: 17, text: "स्री भगवान भजे बिनु भूपति एक रती बिनु एक न लेखै ॥४॥२४॥"
      }, {
        index: 18, text: "सु्ध सिपाह दुरंत दुबाह सु साज सनाह दुरजान दलैंगे ॥"
      }, {
        index: 19, text: "भारी गुमान भरे मन मैं कर परबत पंख हले न हलैंगे ॥"
      }, {
        index: 20, text: "तोरि अरीन मरोरि मवासन माते मतंगन मान मलैंगे ॥"
      }, {
        index: 21, text: "स्री पति स्री भगवान क्रिपा बिनु तिआगि जहान निदान चलैंगे ॥५॥२५॥"
      }, {
        index: 22, text: "बीर अपार बडे बरिआर अबिचारहि सार की धार भछ्या ॥"
      }, {
        index: 23, text: "तोरत देस मलिंद मवासन माते गजान के मान मल्या ॥"
      }, {
        index: 24, text: "गाड़्हे गड़्हान को तोड़नहार सु बातन हीं चक चार लव्या ॥"
      }, {
        index: 25, text: "साहिबु स्री सभ को सिरनाइक जाचक अनेक सु एक दिव्या ॥६॥२६॥"
      }, {
        index: 26, text: "दानव देव फनिंद निसाचर भूत भवि्ख भवान जपैंगे ॥"
      }, {
        index: 27, text: "जीव जिते जल मै थल मै पल ही पल मै सभ थाप थपैंगे ॥"
      }, {
        index: 14, text: "पुंन प्रतापन बाढ जैत धुन पापन के बहु पुंज खपैंगे ॥"
      }, {
        index: 1, text: "साध समूह प्रसंन फिरैं जग सत्र सभै अवलोक चपैंगे ॥७॥२७॥"
      }, {
        index: 2, text: "मानव इंद्र गजिंद्र नराधप जौन त्रिलोक को राज करैंगे ॥"
      }, {
        index: 3, text: "कोटि इसनान गजादिक दान अनेक सुअमबर साज बरैंगे ॥"
      }, {
        index: 4, text: "ब्रहम महेसर बिसन सचीपित अंत फसे जम फासि परैंगे ॥"
      }, {
        index: 5, text: "जे नर स्री पति के प्रस हैं पग ते नर फेर न देह धरैंगे ॥८॥२८॥"
      }, {
        index: 6, text: "कहा भयो जो दोउ लोचन मूंद कै बैठि रहिओ बक धिआन लगाइओ ॥"
      }, {
        index: 7, text: "न्हात फिरिओ लीए सात समुद्रनि लोक गयो परलोक गवाइओ ॥"
      }, {
        index: 8, text: "बास कीओ बिखिआन सो बैठ कै ऐसे ही ऐसे सु बैस बिताइओ ॥"
      }, {
        index: 9, text: "साचु कहों सुन लेहु सभै जिन प्रेम कीओ तिन ही प्रभ पाइओ ॥९॥२९॥"
      }, {
        index: 10, text: "काहू लै पाहन पूज धरयो सिर काहू लै लिंग गरे लटकाइओ ॥"
      }, {
        index: 11, text: "काहू लखिओ हरि अवाची दिसा महि काहू पछाह को सीसु निवाइओ ॥"
      }, {
        index: 12, text: "कोउ बुतान को पूजत है पसु कोउ म्रितान को पूजन धाइओ ॥"
      }, {
        index: 13, text: "कूर क्रिआ उरिझओ सभ ही जग स्री भगवान को भेदु न पाइओ ॥१०॥३०॥"
      }])
      setHighlightIndex(0)
    }
    else if(name==="ChaupaiSahib"){
      settext([  {index:1,text:"ੴ स्री वाहगुरू जी की फतह ॥"
      },{index:2,text:"पातिसाही १० ॥"
      },{index:3,text:"कबियो बाच बेनती ॥"
      },{index:4,text:"चौपई ॥"
      },{index:5,text:"हमरी करो हाथ दै रछा ॥"
      },{index:6,text:"पूरन होइ चि्त की इछा ॥"
      },{index:7,text:"तव चरनन मन रहै हमारा ॥"
      },{index:8,text:"अपना जान करो प्रतिपारा ॥१॥"
      },{index:9,text:"हमरे दुशट सभै तुम घावहु ॥"
      },{index:10,text:"आपु हाथ दै मोहि बचावहु ॥"
      },{index:11,text:"सुखी बसै मोरो परिवारा ॥"
      },{index:12,text:"सेवक सि्खय सभै करतारा ॥२॥"
      },{index:13,text:"मो रछा निजु कर दै करियै ॥"
      },{index:14,text:"सभ बैरिन कौ आज संघरियै ॥"
      },{index:15,text:"पूरन होइ हमारी आसा ॥"
      },{index:16,text:"तोरि भजन की रहै पियासा ॥३॥"
      },{index:17,text:"तुमहि छाडि कोई अवर न धयाऊं ॥"
      },{index:18,text:"जो बर चहों सु तुमते पाऊं ॥"
      },{index:19,text:"सेवक सि्खय हमारे तारियहि ॥"
      },{index:20,text:"चुन चुन श्त्रु हमारे मारियहि ॥४॥"
      },{index:21,text:"आपु हाथ दै मुझै उबरियै ॥"
      },{index:22,text:"मरन काल का त्रास निवरियै ॥"
      },{index:23,text:"हूजो सदा हमारे प्छा ॥"
      },{index:24,text:"स्री असिधुज जू करियहु ्रछा ॥५॥"
      },{index:25,text:"राखि लेहु मुहि राखनहारे ॥"
      },{index:26,text:"साहिब संत सहाइ पियारे ॥"
      },{index:27,text:"दीनबंधु दुशटन के हंता ॥"
      },{index:1,text:"तुमहो पुरी चतुरदस कंता ॥६॥"
      },{index:2,text:"काल पाइ ब्रहमा बपु धरा ॥"
      },{index:3,text:"काल पाइ शिवजू अवतरा ॥"
      },{index:4,text:"काल पाइ करि बिशन प्रकाशा ॥"
      },{index:5,text:"सकल काल का कीया तमाशा ॥७॥"
      },{index:6,text:"जवन काल जोगी शिव कीयो ॥"
      },{index:7,text:"बेद राज ब्रहमा जू थीयो ॥"
      },{index:8,text:"जवन काल सभ लोक सवारा ॥"
      },{index:9,text:"नमशकार है ताहि हमारा ॥८॥"
      },{index:10,text:"जवन काल सभ जगत बनायो ॥"
      },{index:11,text:"देव दैत ज्छन उपजायो ॥"
      },{index:12,text:"आदि अंति एकै अवतारा ॥"
      },{index:13,text:"सोई गुरू समझियहु हमारा ॥९॥"
      },{index:14,text:"नमशकार तिस ही को हमारी ॥"
      },{index:15,text:"सकल प्रजा जिन आप सवारी ॥"
      },{index:16,text:"सिवकन को सवगुन सुख दीयो ॥"
      },{index:17,text:"श्त्रुन को पल मो बध कीयो ॥१०॥"
      },{index:18,text:"घट घट के अंतर की जानत ॥"
      },{index:19,text:"भले बुरे की पीर पछानत ॥"
      },{index:20,text:"चीटी ते कुंचर असथूला ॥"
      },{index:21,text:"सभ पर क्रिपा द्रिशटि करि फूला ॥११॥"
      },{index:22,text:"संतन दुख पाए ते दुखी ॥"
      },{index:23,text:"सुख पाए साधन के सुखी ॥"
      },{index:24,text:"एक एक की पीर पछानै ॥"
      },{index:25,text:"घट घट के पट पट की जानै ॥१२॥"
      },{index:26,text:"जब उदकरख करा करतारा ॥"
      },{index:27,text:"प्रजा धरत तब देह अपारा ॥"
      },{index:14,text:"जब आकरख करत हो कबहूं ॥"
      },{index:1,text:"तुम मै मिलत देह धर सभहूं ॥१३॥"
      },{index:2,text:"जेते बदन स्रिशटि सभ धारै ॥"
      },{index:3,text:"आपु आपुनी बूझि उचारै ॥"
      },{index:4,text:"तुम सभ ही ते रहत निरालम ॥"
      },{index:5,text:"जानत बेद भेद अरु आलम ॥१४॥"
      },{index:6,text:"निरंकार न्रिबिकार न्रिल्मभ ॥"
      },{index:7,text:"आदि अनील अनादि अस्मभ ॥"
      },{index:8,text:"ताका मूड़्ह उचारत भेदा ॥"
      },{index:9,text:"जाको भेव न पावत बेदा ॥१५॥"
      },{index:10,text:"ताकौ करि पाहन अनुमानत ॥"
      },{index:11,text:"महां मूड़्ह कछु भेद न जानत ॥"
      },{index:12,text:"महांदेव कौ कहत सदा शिव ॥"
      },{index:13,text:"निरंकार का चीनत नहि भिव ॥१६॥"
      },{index:14,text:"आपु आपुनी बुधि है जेती ॥"
      },{index:15,text:"बरनत भिंन भिंन तुहि तेती ॥"
      },{index:16,text:"तुमरा लखा न जाइ पसारा ॥"
      },{index:17,text:"किह बिधि सजा प्रथम संसारा ॥१७॥"
      },{index:18,text:"एकै रूप अनूप सरूपा ॥"
      },{index:19,text:"रंक भयो राव कहीं भूपा ॥"
      },{index:20,text:"अंडज जेरज सेतज कीनी ॥"
      },{index:21,text:"उतभुज खानि बहुरि रचि दीनी ॥१८॥"
      },{index:22,text:"कहूं फूलि राजा ह्वै बैठा ॥"
      },{index:23,text:"कहूं सिमटि भयो शंकर इकैठा ॥"
      },{index:24,text:"सगरी स्रिशटि दिखाइ अच्मभव ॥"
      },{index:25,text:"आदि जुगादि सरूप सुय्मभव ॥१९॥"
      },{index:26,text:"अब ्रछा मेरी तुम करो ॥"
      },{index:27,text:"सि्खय उबारि असि्खय स्घरो ॥"
      },{index:1,text:"दुशट जिते उठवत उतपाता ॥"
      },{index:2,text:"सकल मलेछ करो रण घाता ॥२०॥"
      },{index:3,text:"जे असिधुज तव शरनी परे ॥"
      },{index:4,text:"तिन के दुशट दुखित ह्वै मरे ॥"
      },{index:5,text:"पुरख जवन पगु परे तिहारे ॥"
      },{index:6,text:"तिन के तुम संकट सभ टारे ॥२१॥"
      },{index:7,text:"जो कलि कौ इक बार धिऐहै ॥"
      },{index:8,text:"ता के काल निकटि नहि ऐहै ॥"
      },{index:9,text:"रछा होइ ताहि सभ काला ॥"
      },{index:10,text:"दुशट अरिशट टरे ततकाला ॥२२॥"
      },{index:11,text:"क्रिपा द्रिशाटि तन जाहि निहरिहो ॥"
      },{index:12,text:"ताके ताप तनक महि हरिहो ॥"
      },{index:13,text:"रि्धि सि्धि घर मों सभ होई ॥"
      },{index:14,text:"दुशट छाह छ्वै सकै न कोई ॥२३॥"
      },{index:15,text:"एक बार जिन तुमैं स्मभारा ॥"
      },{index:16,text:"काल फास ते ताहि उबारा ॥"
      },{index:17,text:"जिन नर नाम तिहारो कहा ॥"
      },{index:18,text:"दारिद दुशट दोख ते रहा ॥२४॥"
      },{index:19,text:"खड़ग केत मैं शरनि तिहारी ॥"
      },{index:20,text:"आप हाथ दै लेहु उबारी ॥"
      },{index:21,text:"सरब ठौर मो होहु सहाई ॥"
      },{index:22,text:"दुशट दोख ते लेहु बचाई ॥२५॥"
      }])
      setHighlightIndex(0)
    }
    else if(name==="AnandSahib"){
      settext([  {index:1,text:"ੴ सतिगुर प्रसादि ॥"
      },{index:2,text:"अनंदु भइआ मेरी माए सतिगुरू मै पाइआ ॥"
      },{index:3,text:"सतिगुरु त पाइआ सहज सेती मनि वजीआ वाधाईआ ॥"
      },{index:4,text:"राग रतन परवार परीआ सबद गावण आईआ ॥"
      },{index:5,text:"सबदो त गावहु हरी केरा मनि जिनी वसाइआ ॥"
      },{index:6,text:"कहै नानकु अनंदु होआ सतिगुरू मै पाइआ ॥१॥"
      },{index:7,text:"ए मन मेरिआ तू सदा रहु हरि नाले ॥"
      },{index:8,text:"हरि नालि रहु तू मंन मेरे दूख सभि विसारणा ॥"
      },{index:9,text:"अंगीकारु ओहु करे तेरा कारज सभि सवारणा ॥"
      },{index:10,text:"सभना गला समरथु सुआमी सो किउ मनहु विसारे ॥"
      },{index:11,text:"कहै नानकु मंन मेरे सदा रहु हरि नाले ॥२॥"
      },{index:12,text:"साचे साहिबा किआ नाही घरि तेरै ॥"
      },{index:13,text:"घरि त तेरै सभु किछु है जिसु देहि सु पावए ॥"
      },{index:14,text:"सदा सिफति सलाह तेरी नामु मनि वसावए ॥"
      },{index:15,text:"नामु जिन कै मनि वसिआ वाजे सबद घनेरे ॥"
      },{index:16,text:"कहै नानकु सचे साहिब किआ नाही घरि तेरै ॥३॥"
      },{index:17,text:"साचा नामु मेरा आधारो ॥"
      },{index:18,text:"साचु नामु अधारु मेरा जिनि भुखा सभि गवाईआ ॥"
      },{index:19,text:"करि सांति सुख मनि आइ वसिआ जिनि इछा सभि पुजाईआ ॥"
      },{index:20,text:"सदा कुरबाणु कीता गुरू विटहु जिस दीआ एहि वडिआईआ ॥"
      },{index:21,text:"कहै नानकु सुणहु संतहु सबदि धरहु पिआरो ॥"
      },{index:22,text:"साचा नामु मेरा आधारो ॥४॥"
      },{index:23,text:"वाजे पंच सबद तितु घरि सभागै ॥"
      },{index:24,text:"घरि सभागै सबद वाजे कला जितु घरि धारीआ ॥"
      },{index:25,text:"पंच दूत तुधु वसि कीते कालु कंटकु मारिआ ॥"
      },{index:26,text:"धुरि करमि पाइआ तुधु जिन कउ सि नामि हरि कै लागे ॥"
      },{index:27,text:"कहै नानकु तह सुखु होआ तितु घरि अनहद वाजे ॥५॥"
      },{index:1,text:"साची लिवै बिनु देह निमाणी ॥"
      },{index:2,text:"देह निमाणी लिवै बाझहु किआ करे वेचारीआ ॥"
      },{index:3,text:"तुधु बाझु समरथ कोइ नाही क्रिपा करि बनवारीआ ॥"
      },{index:4,text:"एस नउ होरु थाउ नाही सबदि लागि सवारीआ ॥"
      },{index:5,text:"कहै नानकु लिवै बाझहु किआ करे वेचारीआ ॥६॥"
      },{index:6,text:"आनंदु आनंदु सभु को कहै आनंदु गुरू ते जाणिआ ॥"
      },{index:7,text:"जाणिआ आनंदु सदा गुर ते क्रिपा करे पिआरिआ ॥"
      },{index:8,text:"करि किरपा किलविख कटे गिआन अंजनु सारिआ ॥"
      },{index:9,text:"अंदरहु जिन का मोहु तुटा तिन का सबदु सचै सवारिआ ॥"
      },{index:10,text:"कहै नानकु एहु अनंदु है आनंदु गुर ते जाणिआ ॥७॥"
      },{index:11,text:"बाबा जिसु तू देहि सोई जनु पावै ॥"
      },{index:12,text:"पावै त सो जनु देहि जिस नो होरि किआ करहि वेचारिआ ॥"
      },{index:13,text:"इकि भरमि भूले फिरहि दह दिसि इकि नामि लागि सवारिआ ॥"
      },{index:14,text:"गुर परसादी मनु भइआ निरमलु जिना भाणा भावए ॥"
      },{index:15,text:"कहै नानकु जिसु देहि पिआरे सोई जनु पावए ॥८॥"
      },{index:16,text:"आवहु संत पिआरिहो अकथ की करह कहाणी ॥"
      },{index:17,text:"करह कहाणी अकथ केरी कितु दुआरै पाईऐ ॥"
      },{index:18,text:"तनु मनु धनु सभु सउपि गुर कउ हुकमि मंनिऐ पाईऐ ॥"
      },{index:19,text:"हुकमु मंनिहु गुरू केरा गावहु सची बाणी ॥"
      },{index:20,text:"कहै नानकु सुणहु संतहु कथिहु अकथ कहाणी ॥९॥"
      },{index:21,text:"ए मन चंचला चतुराई किनै न पाइआ ॥"
      },{index:22,text:"चतुराई न पाइआ किनै तू सुणि मंन मेरिआ ॥"
      },{index:23,text:"एह माइआ मोहणी जिनि एतु भरमि भुलाइआ ॥"
      },{index:24,text:"माइआ त मोहणी तिनै कीती जिनि ठगउली पाईआ ॥"
      },{index:25,text:"कुरबाणु कीता तिसै विटहु जिनि मोहु मीठा लाइआ ॥"
      },{index:26,text:"कहै नानकु मन चंचल चतुराई किनै न पाइआ ॥१०॥"
      },{index:27,text:"ए मन पिआरिआ तू सदा सचु समाले ॥"
      },{index:1,text:"एहु कुट्मबु तू जि देखदा चलै नाही तेरै नाले ॥"
      },{index:2,text:"साथि तेरै चलै नाही तिसु नालि किउ चितु लाईऐ ॥"
      },{index:3,text:"ऐसा कमु मूले न कीचै जितु अंति पछोताईऐ ॥"
      },{index:4,text:"सतिगुरू का उपदेसु सुणि तू होवै तेरै नाले ॥"
      },{index:5,text:"कहै नानकु मन पिआरे तू सदा सचु समाले ॥११॥"
      },{index:6,text:"अगम अगोचरा तेरा अंतु न पाइआ ॥"
      },{index:7,text:"अंतो न पाइआ किनै तेरा आपणा आपु तू जाणहे ॥"
      },{index:8,text:"जीअ जंत सभि खेलु तेरा किआ को आखि वखाणए ॥"
      },{index:9,text:"आखहि त वेखहि सभु तूहै जिनि जगतु उपाइआ ॥"
      },{index:10,text:"कहै नानकु तू सदा अगमु है तेरा अंतु न पाइआ ॥१२॥"
      },{index:11,text:"सुरि नर मुनि जन अम्रितु खोजदे सु अम्रितु गुर ते पाइआ ॥"
      },{index:12,text:"पाइआ अम्रितु गुरि क्रिपा कीनी सचा मनि वसाइआ ॥"
      },{index:13,text:"जीअ जंत सभि तुधु उपाए इकि वेखि परसणि आइआ ॥"
      },{index:14,text:"लबु लोभु अहंकारु चूका सतिगुरू भला भाइआ ॥"
      },{index:15,text:"कहै नानकु जिस नो आपि तुठा तिनि अम्रितु गुर ते पाइआ ॥१३॥"
      },{index:16,text:"भगता की चाल निराली ॥"
      },{index:17,text:"चाला निराली भगताह केरी बिखम मारगि चलणा ॥"
      },{index:18,text:"लबु लोभु अहंकारु तजि त्रिसना बहुतु नाही बोलणा ॥"
      },{index:19,text:"खंनिअहु तिखी वालहु निकी एतु मारगि जाणा ॥"
      },{index:20,text:"गुर परसादी जिनी आपु तजिआ हरि वासना समाणी ॥"
      },{index:21,text:"कहै नानकु चाल भगता जुगहु जुगु निराली ॥१४॥"
      },{index:22,text:"जिउ तू चलाइहि तिव चलह सुआमी होरु किआ जाणा गुण तेरे ॥"
      },{index:23,text:"जिव तू चलाइहि तिवै चलह जिना मारगि पावहे ॥"
      },{index:24,text:"करि किरपा जिन नामि लाइहि सि हरि हरि सदा धिआवहे ॥"
      },{index:25,text:"जिस नो कथा सुणाइहि आपणी सि गुरदुआरै सुखु पावहे ॥"
      },{index:26,text:"कहै नानकु सचे साहिब जिउ भावै तिवै चलावहे ॥१५॥"
      },{index:27,text:"एहु सोहिला सबदु सुहावा ॥"
      },{index:1,text:"सबदो सुहावा सदा सोहिला सतिगुरू सुणाइआ ॥"
      },{index:2,text:"एहु तिन कै मंनि वसिआ जिन धुरहु लिखिआ आइआ ॥"
      },{index:3,text:"इकि फिरहि घनेरे करहि गला गली किनै न पाइआ ॥"
      },{index:4,text:"कहै नानकु सबदु सोहिला सतिगुरू सुणाइआ ॥१६॥"
      },{index:5,text:"पवितु होए से जना जिनी हरि धिआइआ ॥"
      },{index:6,text:"हरि धिआइआ पवितु होए गुरमुखि जिनी धिआइआ ॥"
      },{index:7,text:"पवितु माता पिता कुट्मब सहित सिउ पवितु संगति सबाईआ ॥"
      },{index:8,text:"कहदे पवितु सुणदे पवितु से पवितु जिनी मंनि वसाइआ ॥"
      },{index:9,text:"कहै नानकु से पवितु जिनी गुरमुखि हरि हरि धिआइआ ॥१७॥"
      },{index:10,text:"करमी सहजु न ऊपजै विणु सहजै सहसा न जाइ ॥"
      },{index:11,text:"नह जाइ सहसा कितै संजमि रहे करम कमाए ॥"
      },{index:12,text:"सहसै जीउ मलीणु है कितु संजमि धोता जाए ॥"
      },{index:13,text:"मंनु धोवहु सबदि लागहु हरि सिउ रहहु चितु लाइ ॥"
      },{index:14,text:"कहै नानकु गुर परसादी सहजु उपजै इहु सहसा इव जाइ ॥१८॥"
      },{index:15,text:"जीअहु मैले बाहरहु निरमल ॥"
      },{index:16,text:"बाहरहु निरमल जीअहु त मैले तिनी जनमु जूऐ हारिआ ॥"
      },{index:17,text:"एह तिसना वडा रोगु लगा मरणु मनहु विसारिआ ॥"
      },{index:18,text:"वेदा महि नामु उतमु सो सुणहि नाही फिरहि जिउ बेतालिआ ॥"
      },{index:19,text:"कहै नानकु जिन सचु तजिआ कूड़े लागे तिनी जनमु जूऐ हारिआ ॥१९॥"
      },{index:20,text:"जीअहु निरमल बाहरहु निरमल ॥"
      },{index:21,text:"बाहरहु त निरमल जीअहु निरमल सतिगुर ते करणी कमाणी ॥"
      },{index:22,text:"कूड़ की सोइ पहुचै नाही मनसा सचि समाणी ॥"
      },{index:23,text:"जनमु रतनु जिनी खटिआ भले से वणजारे ॥"
      },{index:24,text:"कहै नानकु जिन मंनु निरमलु सदा रहहि गुर नाले ॥२०॥"
      },{index:25,text:"जे को सिखु गुरू सेती सनमुखु होवै ॥"
      },{index:26,text:"होवै त सनमुखु सिखु कोई जीअहु रहै गुर नाले ॥"
      },{index:27,text:"गुर के चरन हिरदै धिआए अंतर आतमै समाले ॥"
      },{index:1,text:"आपु छडि सदा रहै परणै गुर बिनु अवरु न जाणै कोए ॥"
      },{index:2,text:"कहै नानकु सुणहु संतहु सो सिखु सनमुखु होए ॥२१॥"
      },{index:3,text:"जे को गुर ते वेमुखु होवै बिनु सतिगुर मुकति न पावै ॥"
      },{index:4,text:"पावै मुकति न होर थै कोई पुछहु बिबेकीआ जाए ॥"
      },{index:5,text:"अनेक जूनी भरमि आवै विणु सतिगुर मुकति न पाए ॥"
      },{index:6,text:"फिरि मुकति पाए लागि चरणी सतिगुरू सबदु सुणाए ॥"
      },{index:7,text:"कहै नानकु वीचारि देखहु विणु सतिगुर मुकति न पाए ॥२२॥"
      },{index:8,text:"आवहु सिख सतिगुरू के पिआरिहो गावहु सची बाणी ॥"
      },{index:9,text:"बाणी त गावहु गुरू केरी बाणीआ सिरि बाणी ॥"
      },{index:10,text:"जिन कउ नदरि करमु होवै हिरदै तिना समाणी ॥"
      },{index:11,text:"पीवहु अम्रितु सदा रहहु हरि रंगि जपिहु सारिगपाणी ॥"
      },{index:12,text:"कहै नानकु सदा गावहु एह सची बाणी ॥२३॥"
      },{index:13,text:"सतिगुरू बिना होर कची है बाणी ॥"
      },{index:14,text:"बाणी त कची सतिगुरू बाझहु होर कची बाणी ॥"
      },{index:15,text:"कहदे कचे सुणदे कचे कची आखि वखाणी ॥"
      },{index:16,text:"हरि हरि नित करहि रसना कहिआ कछू न जाणी ॥"
      },{index:17,text:"चितु जिन का हिरि लइआ माइआ बोलनि पए रवाणी ॥"
      },{index:18,text:"कहै नानकु सतिगुरू बाझहु होर कची बाणी ॥२४॥"
      },{index:19,text:"गुर का सबदु रतंनु है हीरे जितु जड़ाउ ॥"
      },{index:20,text:"सबदु रतनु जितु मंनु लागा एहु होआ समाउ ॥"
      },{index:21,text:"सबद सेती मनु मिलिआ सचै लाइआ भाउ ॥"
      },{index:22,text:"आपे हीरा रतनु आपे जिस नो देइ बुझाइ ॥"
      },{index:23,text:"कहै नानकु सबदु रतनु है हीरा जितु जड़ाउ ॥२५॥"
      },{index:24,text:"सिव सकति आपि उपाइ कै करता आपे हुकमु वरताए ॥"
      },{index:25,text:"हुकमु वरताए आपि वेखै गुरमुखि किसै बुझाए ॥"
      },{index:26,text:"तोड़े बंधन होवै मुकतु सबदु मंनि वसाए ॥"
      },{index:27,text:"गुरमुखि जिस नो आपि करे सु होवै एकस सिउ लिव लाए ॥"
      },{index:1,text:"कहै नानकु आपि करता आपे हुकमु बुझाए ॥२६॥"
      },{index:2,text:"सिम्रिति सासत्र पुंन पाप बीचारदे ततै सार न जाणी ॥"
      },{index:3,text:"ततै सार न जाणी गुरू बाझहु ततै सार न जाणी ॥"
      },{index:4,text:"तिही गुणी संसारु भ्रमि सुता सुतिआ रैणि विहाणी ॥"
      },{index:5,text:"गुर किरपा ते से जन जागे जिना हरि मनि वसिआ बोलहि अम्रित बाणी ॥"
      },{index:6,text:"कहै नानकु सो ततु पाए जिस नो अनदिनु हरि लिव लागै जागत रैणि विहाणी ॥२७॥"
      },{index:7,text:"माता के उदर महि प्रतिपाल करे सो किउ मनहु विसारीऐ ॥"
      },{index:8,text:"मनहु किउ विसारीऐ एवडु दाता जि अगनि महि आहारु पहुचावए ॥"
      },{index:9,text:"ओस नो किहु पोहि न सकी जिस नउ आपणी लिव लावए ॥"
      },{index:10,text:"आपणी लिव आपे लाए गुरमुखि सदा समालीऐ ॥"
      },{index:11,text:"कहै नानकु एवडु दाता सो किउ मनहु विसारीऐ ॥२८॥"
      },{index:12,text:"जैसी अगनि उदर महि तैसी बाहरि माइआ ॥"
      },{index:13,text:"माइआ अगनि सभ इको जेही करतै खेलु रचाइआ ॥"
      },{index:14,text:"जा तिसु भाणा ता जमिआ परवारि भला भाइआ ॥"
      },{index:15,text:"लिव छुड़की लगी त्रिसना माइआ अमरु वरताइआ ॥"
      },{index:16,text:"एह माइआ जितु हरि विसरै मोहु उपजै भाउ दूजा लाइआ ॥"
      },{index:17,text:"कहै नानकु गुर परसादी जिना लिव लागी तिनी विचे माइआ पाइआ ॥२९॥"
      },{index:18,text:"हरि आपि अमुलकु है मुलि न पाइआ जाइ ॥"
      },{index:19,text:"मुलि न पाइआ जाइ किसै विटहु रहे लोक विललाइ ॥"
      },{index:20,text:"ऐसा सतिगुरु जे मिलै तिस नो सिरु सउपीऐ विचहु आपु जाइ ॥"
      },{index:21,text:"जिस दा जीउ तिसु मिलि रहै हरि वसै मनि आइ ॥"
      },{index:22,text:"हरि आपि अमुलकु है भाग तिना के नानका जिन हरि पलै पाइ ॥३०॥"
      },{index:23,text:"हरि रासि मेरी मनु वणजारा ॥"
      },{index:24,text:"हरि रासि मेरी मनु वणजारा सतिगुर ते रासि जाणी ॥"
      },{index:25,text:"हरि हरि नित जपिहु जीअहु लाहा खटिहु दिहाड़ी ॥"
      },{index:26,text:"एहु धनु तिना मिलिआ जिन हरि आपे भाणा ॥"
      },{index:27,text:"कहै नानकु हरि रासि मेरी मनु होआ वणजारा ॥३१॥"
      },{index:1,text:"ए रसना तू अन रसि राचि रही तेरी पिआस न जाइ ॥"
      },{index:2,text:"पिआस न जाइ होरतु कितै जिचरु हरि रसु पलै न पाइ ॥"
      },{index:3,text:"हरि रसु पाइ पलै पीऐ हरि रसु बहुड़ि न त्रिसना लागै आइ ॥"
      },{index:4,text:"एहु हरि रसु करमी पाईऐ सतिगुरु मिलै जिसु आइ ॥"
      },{index:5,text:"कहै नानकु होरि अन रस सभि वीसरे जा हरि वसै मनि आइ ॥३२॥"
      },{index:6,text:"ए सरीरा मेरिआ हरि तुम महि जोति रखी ता तू जग महि आइआ ॥"
      },{index:7,text:"हरि जोति रखी तुधु विचि ता तू जग महि आइआ ॥"
      },{index:8,text:"हरि आपे माता आपे पिता जिनि जीउ उपाइ जगतु दिखाइआ ॥"
      },{index:9,text:"गुर परसादी बुझिआ ता चलतु होआ चलतु नदरी आइआ ॥"
      },{index:10,text:"कहै नानकु स्रिसटि का मूलु रचिआ जोति राखी ता तू जग महि आइआ ॥३३॥"
      },{index:11,text:"मनि चाउ भइआ प्रभ आगमु सुणिआ ॥"
      },{index:12,text:"हरि मंगलु गाउ सखी ग्रिहु मंदरु बणिआ ॥"
      },{index:13,text:"हरि गाउ मंगलु नित सखीए सोगु दूखु न विआपए ॥"
      },{index:14,text:"गुर चरन लागे दिन सभागे आपणा पिरु जापए ॥"
      },{index:15,text:"अनहत बाणी गुर सबदि जाणी हरि नामु हरि रसु भोगो ॥"
      },{index:16,text:"कहै नानकु प्रभु आपि मिलिआ करण कारण जोगो ॥३४॥"
      },{index:17,text:"ए सरीरा मेरिआ इसु जग महि आइ कै किआ तुधु करम कमाइआ ॥"
      },{index:18,text:"कि करम कमाइआ तुधु सरीरा जा तू जग महि आइआ ॥"
      },{index:19,text:"जिनि हरि तेरा रचनु रचिआ सो हरि मनि न वसाइआ ॥"
      },{index:20,text:"गुर परसादी हरि मंनि वसिआ पूरबि लिखिआ पाइआ ॥"
      },{index:21,text:"कहै नानकु एहु सरीरु परवाणु होआ जिनि सतिगुर सिउ चितु लाइआ ॥३५॥"
      },{index:22,text:"ए नेत्रहु मेरिहो हरि तुम महि जोति धरी हरि बिनु अवरु न देखहु कोई ॥"
      },{index:23,text:"हरि बिनु अवरु न देखहु कोई नदरी हरि निहालिआ ॥"
      },{index:24,text:"एहु विसु संसारु तुम देखदे एहु हरि का रूपु है हरि रूपु नदरी आइआ ॥"
      },{index:25,text:"गुर परसादी बुझिआ जा वेखा हरि इकु है हरि बिनु अवरु न कोई ॥"
      },{index:26,text:"कहै नानकु एहि नेत्र अंध से सतिगुरि मिलिऐ दिब द्रिसटि होई ॥३६॥"
      },{index:27,text:"ए स्रवणहु मेरिहो साचै सुनणै नो पठाए ॥"
      },{index:1,text:"साचै सुनणै नो पठाए सरीरि लाए सुणहु सति बाणी ॥"
      },{index:2,text:"जितु सुणी मनु तनु हरिआ होआ रसना रसि समाणी ॥"
      },{index:3,text:"सचु अलख विडाणी ता की गति कही न जाए ॥"
      },{index:4,text:"कहै नानकु अम्रित नामु सुणहु पवित्र होवहु साचै सुनणै नो पठाए ॥३७॥"
      },{index:5,text:"हरि जीउ गुफा अंदरि रखि कै वाजा पवणु वजाइआ ॥"
      },{index:6,text:"वजाइआ वाजा पउण नउ दुआरे परगटु कीए दसवा गुपतु रखाइआ ॥"
      },{index:7,text:"गुरदुआरै लाइ भावनी इकना दसवा दुआरु दिखाइआ ॥"
      },{index:8,text:"तह अनेक रूप नाउ नव निधि तिस दा अंतु न जाई पाइआ ॥"
      },{index:9,text:"कहै नानकु हरि पिआरै जीउ गुफा अंदरि रखि कै वाजा पवणु वजाइआ ॥३८॥"
      },{index:10,text:"एहु साचा सोहिला साचै घरि गावहु ॥"
      },{index:11,text:"गावहु त सोहिला घरि साचै जिथै सदा सचु धिआवहे ॥"
      },{index:12,text:"सचो धिआवहि जा तुधु भावहि गुरमुखि जिना बुझावहे ॥"
      },{index:13,text:"इहु सचु सभना का खसमु है जिसु बखसे सो जनु पावहे ॥"
      },{index:14,text:"कहै नानकु सचु सोहिला सचै घरि गावहे ॥३९॥"
      },{index:15,text:"अनदु सुणहु वडभागीहो सगल मनोरथ पूरे ॥"
      },{index:16,text:"पारब्रहमु प्रभु पाइआ उतरे सगल विसूरे ॥"
      },{index:17,text:"दूख रोग संताप उतरे सुणी सची बाणी ॥"
      },{index:18,text:"संत साजन भए सरसे पूरे गुर ते जाणी ॥"
      },{index:19,text:"सुणते पुनीत कहते पवितु सतिगुरु रहिआ भरपूरे ॥"
      },{index:20,text:"बिनवंति नानकु गुर चरण लागे वाजे अनहद तूरे ॥४०॥१॥"
      }])
      setHighlightIndex(0)
    }
    
  }
  useEffect(() => {
    const interval = setInterval(() => {
      setHighlightIndex(prev => (prev + 1) % text.length);
 
    }, parseInt(delay)*1000); // every 5 seconds

    return () => clearInterval(interval);
  }, [text.length,delay,]);


  return (<div className="flex justify-center items-center min-w-scren min-h-screen relative">
    {text.length === 0 && <main className="min-h-screen flex items-center min-w-screen p-8  flex-wrap gap-8">
      {array.map((item, index) => {
        return <div key={index} onClick={() => showtext(item.name)} className="bg-black cursor-pointer rounded-xl shadow-sm hover:shadow-xl relative  w-[400px] h-[300px] "> <Image key={index} className="images rounded-xl bg--90 hover:bg--100 bg-black" src={item.link} fill="true" alt={item.name}></Image></div>
      }
      )}
      <Link href="/other" className="w-[400px] cursor-pointer h-[300px] flex flex-col items-center justify-center gap-8 border rounded-xl shadow-sm hover:shadow-xl"><span className="text-2xl">Other</span>
        <span className="flex gap-2 text-xl"><span className="rounded-[360%] p-2 flex text-center items-center justify-center bg-black font-bold text-white">+</span>Add One</span>
      </Link>
    </main>}

    {text.length > 0 && <div className={`  w-[100%]  flex flex-col gap-4 items-center justify-center text-center  p-8 text-xl bg-black `}>
    <div className="flex justify-between items-center p-4  w-[100%] -100 cursor-pointer sticky ">
      <span className="font-bold text-[40px] text-white cursor-pointer" onClick={()=>back()}>&#8678;</span>
 <div className="relative group flex flex-col">
      <button type='button'
        onClick={()=>handleSettingsToggle()}
        onTouchStart={()=>handleSettingsToggle()} className='drops  invert groupt cursor-pointer group-hover:hidden'><Image src="/settings.png" alt='SETTINGS' 
        onClick={()=>handleSettingsToggle()}
        onTouchStart={()=>handleSettingsToggle()} width={35} height={35} className=' drop'></Image></button>


     {issettingopen&& <div className="box rounded-xl z-index-1 cursor-pointer bg-[#1c1c1c] text-white absolute top-[-70px] w-[325px]  group-hover:flex-col group-hover:flex hover:flex-col right-[-48px]  flex flex-col   p-8  gap-4">

<span className="text-xl italic text-white">* Start Reading will enable the sleeping mod and highlights the words</span>
      <span className="text-xl italic text-white">* Number of words are the number of words which are being on same colour</span>
      <span className="text-xl italic text-white">* Delay is the timestamp between highlighting text</span>
      <div className="flex  gap-2 justify-center items-center text-center w-[100%]">
        <select name="language"  id="language "className='bg-[#1c1c1c] border border-white rounded-xl w-[100%] text-white'onChange={e=>translate(e.target.value)} >
          <option value="hindi" className='w-[100%] cursor-pointer border border-white rounded-xl' >Hindi</option>
          <option value="punjabi" className='w-[100%] cursor-pointer border border-white rounded-xl' >Punjabi</option>
        </select>
        </div>
        <div className="flex flex-col justify-center items-center text-center w-[100%]">
          <span className="w-[100%] justify-left text-xl text-white">Number of random coloured lines:</span>
<input type="number" name="lines" id="lines" className='border border-white rounded-xl p-4' value={lines} onChange={e=>setLines(e.target.value)} />
        </div>
      <div className="flex  gap-2 justify-center items-center">
        <label htmlFor="delay">Delay:</label>
        <input type="number" name="delay" className='border p-4 border-white rounded-xl
bo' id="delay" value={delay}  onChange={(e)=>setDelay((e.target.value))} />
        </div>
        <button className='p-2 xl:px-6 bg-black text-white p-4 rounded-xl cursor-pointer' onClick={()=>setHighlightIndex(0)}>Start Reading!</button>
        
      </div>}
      </div>    </div>
      {text.map((item, index) => {

const colorIndex = Math.floor(index / (lines || 4)) % color.length;
        return (
          <span
            key={index}
            onClick={()=>{setHighlightIndex(index)
                         if(issettingopen===true){handleSettingsToggle()}
                         }}
  
            className={`px-1 z-index-0 transition-all cursor-pointer  ${color[colorIndex].text}  transition-all duration-700 ease-in-out flex flex-col  rounded-xl  ${highlightIndex === index ? `${color[colorIndex].bg}  scale-110  shadow-sm shadow-current` : ''
             }`}
          >
            {item.text + " "} ;
          </span>
        );
      })}
    </div>}</div>
  );
}
